In [ ]:
from collections import OrderedDict
dict1 = {'ravi': '10', 'rajnish': '9',
        'sanjeev': '15', 'yash': '2', 'suraj': '32'}
result = OrderedDict()

In [1]:
key_value={'l':11,'o':89,'a':88,'d':42,'p':5}
result = dict(sorted(key_value.items()))
result

{'a': 88, 'd': 42, 'l': 11, 'o': 89, 'p': 5}

In [2]:
key_value={'l':11,'o':89,'a':88,'d':42,'p':5}
result = dict(sorted(key_value.items()))
result

{'a': 88, 'd': 42, 'l': 11, 'o': 89, 'p': 5}

In [3]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
result = dict(sorted(dt.items(),key=lambda x : x[1]))
result

{'cc': 3, 'bb': 6, 'dd': 12, 'aa': 44}

In [4]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
result = dict(sorted(dt.items(),key=lambda x : x[1]))
result

{'cc': 3, 'bb': 6, 'dd': 12, 'aa': 44}

In [5]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
result = dt.values()
sum(result)

65

In [6]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
sum1 = 0 
for i in dt.values():
    sum1 += i
sum1

65

In [7]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
del test_dict["Arushi"]
test_dict

{'Mani': 21, 'Haritha': 21}

In [8]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
del test_dict["Mani"]
test_dict

{'Arushi': 22, 'Haritha': 21}

In [9]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
test_dict.pop("Arushi")

22

In [10]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
result = {**d1,**d2}
result

{'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32,
 'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12}

In [11]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
result = {**d2,**d1}
result

{'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12,
 'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32}

In [12]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
d1.update(d2)
d1

{'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32,
 'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12}

In [14]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
d2.update(d1)
d2

{'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12,
 'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32}

In [15]:
def calc(percent):
    if percent >= 90:
        return "A+"
    elif 80 <= percent < 90:
        return "A"
    elif 70 <= percent < 80:
        return "B"
    elif 60 <= percent < 70:
        return "C"
    elif 50 <= percent < 60:
        return "D"
    else:
        return "Fail"
    
def main():
    total_marks = 0 
    no_of_subjects = int(input("Enter the number of subjects:"))

    for i in range(no_of_subjects):
        marks = eval(input("Enter the marks of the subject:"))
        total_marks += marks

    average_percent = total_marks / no_of_subjects
    grade = calc(average_percent)
    print(f"Percentage recieved by the student is : {average_percent}")
    print(f"Grade recieved by Student is :{grade}")

if __name__ == "__main__":
    main()

Percentage recieved by the student is : 76.66666666666667
Grade recieved by Student is :B

In [17]:
words = ["listen", "silent", "enlist", "hello", "world", "act", "cat", "dog", "god"]
anagram_dict = {}
for word in words:
    sorted_word = " ".join(sorted(word))

    if sorted_word in anagram_dict:
        anagram_dict[sorted_word].append(word)
    else:
        anagram_dict[sorted_word] = [word]
anagram_dict

{'e i l n s t': ['listen', 'silent', 'enlist'],
 'e h l l o': ['hello'],
 'd l o r w': ['world'],
 'a c t': ['act', 'cat'],
 'd g o': ['dog', 'god']}

In [18]:
words = ["listen", "silent", "enlist", "hello", "world", "act", "cat", "dog", "god"]
anagram_dict = {}
for word in words:
    sorted_word = " ".join(sorted(word))

    if sorted_word in anagram_dict:
        anagram_dict[sorted_word].append(word)
    else:
        anagram_dict[sorted_word] = [word]
anagram_dict

{'e i l n s t': ['listen', 'silent', 'enlist'],
 'e h l l o': ['hello'],
 'd l o r w': ['world'],
 'a c t': ['act', 'cat'],
 'd g o': ['dog', 'god']}

In [19]:
def check_bin(num1,num2):
    binary_1 = bin(num1)[2:]
    binary_2 = bin(num2)[2:]

    return sorted(binary_1) == sorted(binary_2)

num1 = 10 
num2 = 10
if check_bin(num1,num2):
    print(f"The binary representation of {num1} and {num2} are anagrams")
else:
    print(f"The binary representation of {num1} and {num2} are not anagram")

The binary representation of 10 and 10 are anagrams

In [20]:
from collections import Counter
def largest(words):
    words_count = Counter("".join(sorted(word)) for word in words)
    result = max(words_count.values(),default=0)
    return result

word_list = ["listen", "silent", "enlist", "dog", "god", "good"]
final = largest(word_list)
final

3

In [21]:
from collections import Counter
def largest(words):
    words_count = Counter("".join(sorted(word)) for word in words)
    result = max(words_count.values(),default=0)
    return result

word_list = ["listen", "silent", "enlist", "dog", "god", "good"]
final = largest(word_list)
final

3

In [22]:
freq = {}
list1 = [1, 1, 1, 5, 5, 3, 1, 3, 3, 1,4, 4, 4, 2, 2, 2, 2]
for i in list1:
    if i in freq:
        freq[i] += 1
    else:
        freq[i] = 1
freq

{1: 5, 5: 2, 3: 3, 4: 3, 2: 4}

In [23]:
freq = {}
list1 = [1, 1, 1, 5, 5, 3, 1, 3, 3, 1,4, 4, 4, 2, 2, 2, 2]
for i in list1:
    if i in freq:
        freq[i] += 1
    else:
        freq[i] = 1
freq

{1: 5, 5: 2, 3: 3, 4: 3, 2: 4}

In [24]:
tups = [("akash", 10), ("gaurav", 12), ("anand", 14), 
    ("suraj", 20), ("akhil", 25), ("ashish", 30)]
result = dict(tups)
result

{'akash': 10,
 'gaurav': 12,
 'anand': 14,
 'suraj': 20,
 'akhil': 25,
 'ashish': 30}

In [25]:
numbers = [2, 3, 4, 5, 6]

result = [(num ** 2) for num in numbers]
result

[4, 9, 16, 25, 36]

In [26]:
numbers = [2, 3, 4, 5, 6]

result = [(num ** 3) for num in numbers]
result

[8, 27, 64, 125, 216]

In [27]:
tuples_list = [(2, 8), (3, 27), (1, 1), (5, 125), (4, 64)]

result = dict(sorted(tuples_list, key=lambda x : x[1]))
result

{1: 1, 2: 8, 3: 27, 4: 64, 5: 125}

In [28]:
tuples_list = [(2, 8), (3, 27), (1, 1), (5, 125), (4, 64)]

result = dict(sorted(tuples_list))
result

{1: 1, 2: 8, 3: 27, 4: 64, 5: 125}

In [4]:
subject_marks = [("English",88) , ("Science",90) , ("Maths",97) , ("Social sciences",82)]
result = sorted(subject_marks,key=lambda x : x[1])
result

[('Social sciences', 82), ('English', 88), ('Science', 90), ('Maths', 97)]

In [5]:
list1 = [{"name" : "Nandini" , "age" : 20} ,
        {"name" : "Manjeet" , "age" : 20} ,
        {"name" : "Nikhil" , "age" : 19}]
result = sorted(list1,key=lambda x : x["age"])
result

[{'name': 'Nikhil', 'age': 19},
 {'name': 'Nandini', 'age': 20},
 {'name': 'Manjeet', 'age': 20}]

In [6]:
list1 = [{"name" : "Nandini" , "age" : 20} ,
        {"name" : "Manjeet" , "age" : 20} ,
        {"name" : "Nikhil" , "age" : 19}]
result = sorted(list1,key=lambda x : x["name"])
result

[{'name': 'Manjeet', 'age': 20},
 {'name': 'Nandini', 'age': 20},
 {'name': 'Nikhil', 'age': 19}]

In [7]:
list1 = [{"name" : "Nandini" , "age" : 20} ,
        {"name" : "Manjeet" , "age" : 20} ,
        {"name" : "Nikhil" , "age" : 19}]
result = sorted(list1,key=lambda x : (x["age"],x["name"]))
result

[{'name': 'Nikhil', 'age': 19},
 {'name': 'Manjeet', 'age': 20},
 {'name': 'Nandini', 'age': 20}]

In [8]:
input_numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [(x**2) for x in input_numbers]
result

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [9]:
result = [(lambda x : x**2)(num) for num in input_numbers]
result

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [10]:
input_numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [(lambda x : x**3)(num) for num in input_numbers]
result

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [11]:
result = lambda x : True if x.startswith("P") else False 
print(result("Python"))

True

In [12]:
result = lambda x : True if x.startswith("M") else False
print(result("My"))

True

In [13]:
result = (lambda string : string.isdigit())(string = "1234")
result

True

In [14]:
result = (lambda string : string.isdecimal())(string = "1234")
result

True

In [15]:
result = (lambda string : string.isnumeric())(string = "1234")
result

True

In [16]:
import re
result = (lambda string : re.findall(r"[0-9]{1,}",string))(string = "1234")
result

['1234']

In [17]:
num = 9 
f1 = 0 
f2 = 1
print(f1,f2,end=" ")
for i in range(2,num):
    f3 = f1 + f2
    f1,f2 = f2,f3
    print(f3,end=" ")

0 1 1 2 3 5 8 13 21

In [18]:
num = 9 
f1 = 0 
f2 = 1
print(f1,f2,end=" ")
for i in range(2,num):
    f3 = f1 + f2
    f1,f2 = f2,f3
    print(f3,end=" ")

0 1 1 2 3 5 8 13 21

In [19]:
num = 5 
f1 = 0 
f2 = 1
print(f1,f2,end=" ")
for i in range(2,num):
    f3 = f1 + f2
    f1,f2 = f2,f3
    print(f3,end=" ")

0 1 1 2 3

In [20]:
list1 = [1,2,3,4]
list2 = [3,4,5,6]
result = list(filter(lambda x : x in list1,list2))
result

[3, 4]

In [21]:
list1 = [1,2,3,4]
list2 = [3,4,5,6]
result = list(filter(lambda x : x in list2,list1))
result

[3, 4]

In [24]:
list1 = [-1,2,-3,5,7,8,9,-10]
result = lambda list1 : [x for x in list1 if x >= 0] + [x for x in list1 if x < 0]
result(list1)

[2, 5, 7, 8, 9, -1, -3, -10]

In [25]:
list1 = [-1,2,-3,5,7,8,9,-10]
result = lambda list1 : [x for x in list1 if x >= 0] + [x for x in list1 if x < 0]
result(list1)

[2, 5, 7, 8, 9, -1, -3, -10]

In [26]:
array_nums = [1,2,3,5,7,8,9,10]
odd = len(list(filter(lambda x : (x%2!=0),array_nums)))
even = len(list(filter(lambda x : (x%2==0),array_nums)))
odd

5

In [27]:
even

3

In [28]:
list1 = [1,2,3]
list2 = [4,5,6]
result = list(map(lambda x1,x2 : x1+x2,list1,list2))
result

[5, 7, 9]

In [29]:
list1 = [1,2,3]
list2 = [4,5,6]
result = list(map(lambda x1,x2 : x1+x2,list1,list2))
result

[5, 7, 9]

In [30]:
list1 = [13,26,38,39,57,15,17]
result = list(filter(lambda x : (x%13==0 or x%19==0),list1))
result

[13, 26, 38, 39, 57]

In [31]:
texts = ["php" , "w3r" , "Python" , "abcd" ,"Java" , "aaa"]
result = list(filter(lambda x : (x == "".join(reversed(x))),texts))
result

['php', 'aaa']

In [32]:
texts = ["php" , "w3r" , "Python" , "abcd" ,"Java" , "aaa"]
result = list(filter(lambda x : (x == "".join(reversed(x))),texts))
result

['php', 'aaa']

In [33]:
from collections import Counter
texts = ["bcda","abce","cbda","cbea","adcb"]
str1 = "abcd"
result = list(filter(lambda x : (Counter(str1) == Counter(x)),texts))
result

['bcda', 'cbda', 'adcb']

In [34]:
from collections import Counter
texts = ["bcda","abce","cbda","cbea","adcb"]
str1 = "abcd"
result = list(filter(lambda x : (Counter(str1) == Counter(x)),texts))
result

['bcda', 'cbda', 'adcb']

In [35]:
list1 = [2,3,4,5]
result = list(map(lambda x : x*5 , list1))
result

[10, 15, 20, 25]

In [37]:
list1 = [-1,-2,3,4]
positive = list(map(lambda list1 : list1 > 0 ,list1))
negative = list(map(lambda list1 : list1 < 0 ,list1))
sum(positive)

2

In [38]:
sum(negative)

2

In [41]:
list1 = [-1,-2,3,4]
positive = list(filter(lambda list1 : list1 > 0 ,list1))
negative = list(filter(lambda list1 : list1 < 0 ,list1))
sum(positive)

7

In [42]:
sum(negative)

-3

In [43]:
list1 = [[0],[1,3],[5,7],[9,11],[13,15,17]]
result = max(list1,key=lambda x : len(x))
result

[13, 15, 17]

In [44]:
list1 = [[0],[1,3],[5,7],[9,11],[13,15,17]]
result = min(list1 , key=lambda x : len(x))
result

[0]

In [45]:
list1 = [1,2,3,4,5,6,7,8,9,10]
list2 = [2,4,6,8]
result = list(filter(lambda x : x not in list2,list1))
result

[1, 3, 5, 7, 9, 10]

In [46]:
list1 = [1,2,3,4,5,6,7,8,9,10]
list2 = [2,4,6,8]
result = list(filter(lambda x : x not in list2,list1))
result

[1, 3, 5, 7, 9, 10]

In [49]:
tuple_str = (("223","ABCD","33") , ("1416","EFGH","55") , ("2345","WERT","34"))
result = tuple(map(lambda  x : (int(x[0]),int(x[2])),tuple_str))
result

((223, 33), (1416, 55), (2345, 34))

In [50]:
tuple_str = (("223","ABCD","33") , ("1416","EFGH","55") , ("2345","WERT","34"))
result = tuple(map(lambda x : (int(x[0]),int(x[2])),tuple_str))
result

((223, 33), (1416, 55), (2345, 34))

In [51]:
nums = [3,4,5,8,0,3,8,5,0,3,1,5,2,3,4,2]
result = dict(map(lambda x : (x , list(nums).count(x)),nums))
result

{3: 4, 4: 2, 5: 3, 8: 2, 0: 2, 1: 1, 2: 2}

In [52]:
nums = [3,4,5,8,0,3,8,5,0,3,1,5,2,3,4,2]
result = dict(map(lambda x : (x,list(nums).count(x)),nums))
result

{3: 4, 4: 2, 5: 3, 8: 2, 0: 2, 1: 1, 2: 2}

In [54]:
l1 = [1,2,3]
l2 = [4,5,6]
l3 = [7,8,9]
result = list(map(lambda x1,x2,x3 : x1+x2+x3,l1,l2,l3))
result

[12, 15, 18]

In [55]:
l1 = [1,2,3]
l2 = [4,5,6]
l3 = [7,8,9]
result = list(map(lambda x1,x2,x3 : x1+x2+x3,l1,l2,l3))
result

[12, 15, 18]

In [2]:
l1 = ["yellow","blue","tricolor"]
result = list(map(list,l1))
result

[['y', 'e', 'l', 'l', 'o', 'w'],
 ['b', 'l', 'u', 'e'],
 ['t', 'r', 'i', 'c', 'o', 'l', 'o', 'r']]

In [3]:
l1 = ["yellow","blue","tricolor"]
result = list(map(list,l1))
result

[['y', 'e', 'l', 'l', 'o', 'w'],
 ['b', 'l', 'u', 'e'],
 ['t', 'r', 'i', 'c', 'o', 'l', 'o', 'r']]

In [4]:
l1 = [12,15,18]
result = list(map(lambda x : x**2 , l1))
result

[144, 225, 324]

In [5]:
list1 = [1, 2, 3, 4, 5]
list2 = [5, 4, 3, 2, 1]
result = list(map(lambda x,y : x+y , list1, list2))
result

[6, 6, 6, 6, 6]

In [6]:
result = list(map(lambda x,y : x-y,list1,list2))
result

[-4, -2, 0, 2, 4]

In [7]:
int_list = [1, 2, 3, 4, 5]
result = list(map(lambda x : str(x),int_list))
result

['1', '2', '3', '4', '5']

In [8]:
int_tuple = (6, 7, 8, 9, 10)
result = list(map(lambda x : str(x),int_tuple))
result

['6', '7', '8', '9', '10']

In [9]:
num_array = [1, 2, 3, 4, 5]
result = sum(map(lambda x : x,num_array))
result

15

In [10]:
list1 = [1, 2, 3, 4, 5]
list2 = [1, 2, 4, 8, 9]

result = sum(map(lambda x,y : x == y,list1,list2))
result

2

In [11]:
list1 = [1, 2, 3, 4, 5]
list2 = [1, 2, 4, 8, 9]
result = sum(map(lambda x,y : x==y,list1,list2))
result

2

In [12]:
str1 = ["python","machine","learning"]
result = list(map(list,str1))
result

[['p', 'y', 't', 'h', 'o', 'n'],
 ['m', 'a', 'c', 'h', 'i', 'n', 'e'],
 ['l', 'e', 'a', 'r', 'n', 'i', 'n', 'g']]

In [13]:
str1 = ["python","machine","learning"]
result = list(map(list,str1))
result

[['p', 'y', 't', 'h', 'o', 'n'],
 ['m', 'a', 'c', 'h', 'i', 'n', 'e'],
 ['l', 'e', 'a', 'r', 'n', 'i', 'n', 'g']]

In [14]:
list_tup = [("python","machine"),("learning","data science")]
result = list(map(" ".join,list_tup))
result

['python machine', 'learning data science']

In [15]:
list_tup = [("python","machine"),("learning","data science")]
result = list(map(" ".join,list_tup))
result

['python machine', 'learning data science']

In [16]:
l1 = [1,2,3]
l2 = [1,2,4,5,6]
result = list(filter(lambda x : x not in l1,l2))
result

[4, 5, 6]

In [19]:
l1 = [1,2,3]
l2 = [1,2,4,5,6]
result = list(filter(lambda x : x not in l2,l1))
result

[3]

In [23]:
from nltk.corpus import stopwords
string = "Hi i am abhishek"
stopword_list = stopwords.words("english")
result = filter(lambda x : x.lower() not in stopword_list,string)
final = " ".join(result)
final

AttributeError: module 'nltk' has no attribute 'data'

In [24]:
l1 = [1,2,3]
l2 = [1,2,4,5,6]
result = list(filter(lambda x : x in l1,l2))
result

[1, 2]

In [25]:
l1 = [1,2,3]
result = list(filter(lambda x : (x%2!=0),l1))
result

[1, 3]

In [26]:
l1 = [1,2,3]
result = list(filter(lambda x : (x%2==0),l1))
result

[2]

In [1]:
with open("Abhishek1.txt") as f:
    result = f.read()
    print(result)

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is God owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is god owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing

In [2]:
with open("Abhishek1.txt") as f:
    result = f.readline()
    print(result)

Data Science:

In [4]:
text = """1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing"""
with open("Abhishek1.txt","a") as f:
    f.write(text)
    f.close()

In [5]:
with open("Abhishek1.txt","r") as f:
    result = f.read()
    print(result)

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is God owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is god owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing

In [6]:
with open("Abhishek1.txt","r") as f:
    result = f.read(-2)
    print(result)

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is God owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is god owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing

In [8]:
with open("Abhishek1.txt","r") as f:
    result = f.readlines()
    print(result[-2:])

[' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing']

In [9]:
with open("Abhishek1.txt","r") as f:
    result = f.readlines()
    print(result)

['Data Science:\n', '    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge\n', '    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of \n', '    application domains.1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language ProcessingHe is God owns soldier1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language ProcessingHe is god owns soldier1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing']

In [10]:
with open("Abhishek1.txt","r") as f:
    result = f.readlines()
    print(len(result))

19

In [11]:
import shutil 
with open("Abhishek1.txt","r") as f:
    result = f.read()
    print(result)

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is God owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is god owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing

In [12]:
with open("Abhishek1.txt","r") as f:
    result = f.read()
    print(result)

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is God owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is god owns soldier1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing

In [14]:
from datetime import datetime

current_datetime = datetime.now()
print("Current datetime :",current_datetime)

current_year = current_datetime.year
print("Current year :",current_year)

result = current_datetime.strftime("%B")
print("Month of the year:",result)

result = current_datetime.strftime("%U")
print("Week number of the year :",result)

result = current_datetime.strftime("%A")
print("Day of the year :",result)

result = current_datetime.strftime("%j")
print("Day of the year:",result)

result = current_datetime.strftime("%d")
print("Day of the month :",result)

result = current_datetime.strftime("%A")
print("Day of the week:",result)

Current datetime : 2024-04-07 10:34:16.078123
Current year : 2024
Month of the year: April
Week number of the year : 14
Day of the year : Sunday
Day of the year: 098
Day of the month : 07
Day of the week: Sunday

In [15]:
year = int(input("Enter a year:"))

if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print(f"{year} is a leap year")
else:
    print(f"{year} is not a leap year")

2004 is a leap year

In [16]:
year = int(input("Enter a year:"))

if (year % 400 == 0 and year % 100 != 0) or (year % 400 == 0):
    print(f"{year} is a leap year")
else:
    print(f"{year} is not a leap year")

2017 is not a leap year

In [17]:
date_format = "jan 1 2014 2:43PM"
date1 = "%b %d %Y %I:%M%p"
result = datetime.strptime(date_format,date1)
result

datetime.datetime(2014, 1, 1, 14, 43)

In [18]:
from datetime import timedelta
current_datetime = datetime.today()
result = current_datetime + timedelta(days=1)
result

datetime.datetime(2024, 4, 8, 10, 48, 19, 53521)

In [19]:
result = datetime.today() + timedelta(days=-1)
print("Date of yesterday:",result)
result = datetime.today() + timedelta(days=0)
print("Date of today:",result)
result = datetime.today() + timedelta(days=+1)
print("Date of tommorrow:",result)

Date of yesterday: 2024-04-06 10:53:04.980703
Date of today: 2024-04-07 10:53:04.981602
Date of tommorrow: 2024-04-08 10:53:04.982112

In [20]:
current_datetime = datetime.today()
print(current_datetime)

2024-04-07 11:07:31.865861

In [22]:
current_datetime = datetime.now().date()
current_datetime

datetime.date(2024, 4, 7)

In [23]:
for i in range(5):
    result = current_datetime + timedelta(days=i)
    print("Next 5 days starting from today:",result)

Next 5 days starting from today: 2024-04-07
Next 5 days starting from today: 2024-04-08
Next 5 days starting from today: 2024-04-09
Next 5 days starting from today: 2024-04-10
Next 5 days starting from today: 2024-04-11

In [25]:
current_datetime = datetime.now()
print(current_datetime)
result = current_datetime.replace(microsecond=0)
print(result)

2024-04-07 11:10:55.505556
2024-04-07 11:10:55

In [28]:
import os 
with open("Abhishek1.txt","w") as f:
    f.write("He is god owns soldier")

with open("Abhishek1.txt","r") as f:
    result = f.read()
    print(result)

He is god owns soldier

In [29]:
os.rename("Abhishek1.txt","Abhishek.txt")

In [30]:
os.listdir()

['.git',
 'Abhi',
 'Abhishek.txt',
 'adaboost.ipynb',
 'Adaboost_Ass.ipynb',
 'ai4i2020.csv',
 'Ann_implementation.ipynb',
 'Assignment_1.ipynb',
 'Assignment_10.ipynb',
 'Assignment_11.ipynb',
 'Assignment_12.ipynb',
 'Assignment_13_LinearR.ipynb',
 'Assignment_2.ipynb',
 'Assignment_3.ipynb',
 'Assignment_4.ipynb',
 'Assignment_6.ipynb',
 'Assignment_7.ipynb',
 'Assignment_8.ipynb',
 'Assignment_9.ipynb',
 'Assignment_DT.ipynb',
 'Assignment_KNN.ipynb',
 'autos_dataset.csv',
 'Bangalore.ipynb',
 'Bengaluru_House_Data.csv',
 'Book2.csv',
 'Boston.csv',
 'CNN.ipynb',
 'CNN_proj_explanation.ipynb',
 'CNN_rev.ipynb',
 'Copy1.txt',
 'Country_clusters.csv',
 'DataFrame.csv',
 'DataFrame.xlsx',
 'dataset_es_train.csv',
 'Decision tree HYP_Tuning.png',
 'Decision Tree.png',
 'DecisionTree.ipynb',
 'Decision_Tree.png',
 'Decision_Tree_HYP.png',
 'Decision_Tree_REG_WithoutHYP.png',
 'Decision_TRee_Working.ipynb',
 'Deep_Learning.ipynb',
 'Deep_Learning_rev.ipynb',
 'DegreeofFreedom.png',
 'diabetes.csv',
 'Dim_red_tech.ipynb',
 'DRT.REV.ipynb',
 'DT_multiclass_clf.ipynb',
 'DT_Multiclass_clf_withoutHYP.png',
 'DT_Pruning.ipynb',
 'DT_pruning_revision.ipynb',
 'DT_regression.ipynb',
 'Elbow_method.png',
 'Emp_data.csv',
 'Emp_Records.xlsx',
 'emp_test1.csv',
 'heart.csv',
 'iframe_figures',
 'Imp_Interview_approach.ipynb',
 'IMP_Questions.ipynb',
 'Interview_questions.ipynb',
 'Iris.csv',
 'kmeans_clustering.ipynb',
 'KNN_all_clustering.ipynb',
 'KNN_classification.ipynb',
 'KNN_Clustering_Ass.ipynb',
 'Knn_Imputer.ipynb',
 'KNN_Regression.ipynb',
 'KNN_revision.ipynb',
 'Linear_reg_assignment.ipynb',
 'Linear_reg_theory.ipynb',
 'loan_data.csv',
 'Logistic_reg_assignment.ipynb',
 'movies_data.csv',
 'Naive_Bayes.ipynb',
 'Naive_Bayes_Ass.ipynb',
 'neg',
 'NLP.ipynb',
 'NLP_mini_project',
 'NLP_rev.ipynb',
 'PCA.ipynb',
 'PCA_rev.ipynb',
 'pos',
 'Predictive maintenance.ipynb',
 'Project.ipynb',
 'Prompt_Engineering.ipynb',
 'Python 1.ipynb',
 'python 10.ipynb',
 'python 11.ipynb',
 'python 12.ipynb',
 'python 2.ipynb',
 'python 3.ipynb',
 'python 4.ipynb',
 'python 5.ipynb',
 'python 6.ipynb',
 'python 7.ipynb',
 'python 8.ipynb',
 'python 9.ipynb',
 'Python_13.ipynb',
 'Python_14.ipynb',
 'Python_15.ipynb',
 'python_16.ipynb',
 'python_17.ipynb',
 'Random_forest_clf.ipynb',
 'README.md',
 'Sample.xls',
 'Sample1.xlsx',
 'Sampling.ipynb',
 'Scoring.png',
 'Social_Network_Ads.csv',
 'student.csv',
 'Support_vector_machine.ipynb',
 'SVM_Assignment.ipynb',
 'titanic.csv',
 'Train.csv',
 'weather.csv',
 'weather1.csv',
 'word2vec.model']

In [1]:
import pandas as pd 
df = pd.read_csv("diabetes.csv")
df

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1
3,150,66,23,94,28.1,0.167,21,0
4,150,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...
763,101,76,48,180,32.9,0.171,63,0
764,122,70,27,0,36.8,0.340,27,0
765,121,72,23,112,26.2,0.245,30,0
766,126,60,0,0,30.1,0.349,47,1
767,93,70,31,0,30.4,0.315,23,0

In [1]:
import re 
string = "Python and Machine Learning 7741 is syllabus of Data Science."
result = re.findall("[a-zA-Z0-9]",string)
if result:
    print("Conatins characters")
else:
    print("Doesnot contains characters")

Conatins characters

In [2]:
string = "Python and Machine Learning is syllabus of data science and deep learning."
result = re.split("and",string)
result

['Python ',
 ' Machine Learning is syllabus of data science ',
 ' deep learning.']

In [3]:
string = "Python and Machine Learning is syllabus of data science and deep learning."
result = re.split("is",string)
result

['Python and Machine Learning ',
 ' syllabus of data science and deep learning.']

In [4]:
str1='Python and Data Science Batch 2023'
result = re.findall(r"\bab*[a-z]*\b",str1)
result

['and']

In [5]:
str1='Python and Data Science Batch 2023'
result = re.findall(r"\ba..\b",str1)
result

['and']

In [8]:
sample_string = "There are 123 45 678 90 2345 67 12 345 6789 0123 three-digit"
result = re.findall(r"\b\d{3}\s{1}\d{2}\b",sample_string)
result

['123 45', '678 90']

In [9]:
str1= "python and data pytthon science pythonnn pyyth annd pythh"
result = re.findall(r"p+",str1)
result

['p', 'p', 'p', 'p', 'p']

In [10]:
str1 = 'We can write INFORM in lowercase as inform'
result = re.findall(r"INFORM|inform",str1)
result

['INFORM', 'inform']

In [11]:
str1= " data science and pytthon science abbbss and pyt"
result = re.findall(r"py?",str1)
result

['py', 'py']

In [12]:
str1= "python and data pbbbtthon science pytbbbonnn and pyt"
result = re.findall(r"\b\w*[b]{3}\w*\b",str1)
result

['pbbbtthon', 'pytbbbonnn']

In [13]:
str1= "python and data pbbbtthon science pytbbbonnn and pyt"
result = re.findall(r"\b\w*[b]{3}\w*\b",str1)
result

['pbbbtthon', 'pytbbbonnn']

In [14]:
str1= "abbbs and data abbbsolutely science abbrivation and pyt"
result = re.findall(r"\b\w*[b]{2,3}\w*\b",str1)
result

['abbbs', 'abbbsolutely', 'abbrivation']

In [16]:
str1= "abbbs and data abbbsolutely or science an abbrivation and pyt"
result = re.findall(r"\b\w{3,5}\b",str1)
result

['abbbs', 'and', 'data', 'and', 'pyt']

In [17]:
str1= "abbbs and data abbbsolutely or science_ an abbrivation_ and pyt_"
result = re.findall(r"[a-z]+[_]",str1)
result

['science_', 'abbrivation_', 'pyt_']

In [18]:
str1= "Abbbs and Data Abbbsolutely or Science_ an Abbrivation_ and pyt_"
result = re.findall(r"[A-Z][a-z]+",str1)
result

['Abbbs', 'Data', 'Abbbsolutely', 'Science', 'Abbrivation']

In [21]:
str1= "data absorb Science and Abbrivation and pyt"
result = re.findall(r"\ba.+b\b",str1)
result

['absorb']

In [23]:
str1 = 'Suceess is a jurney not a desti9nation.'
result = re.findall(r"Suceess",str1)
result

['Suceess']

In [24]:
str1 = 'new begening of LIFE .'
result = re.findall("LIFE .",str1)
result

['LIFE .']

In [25]:
str1 = "today is the very lazy day"
result = re.findall(r"\w*z\w*",str1)
result

['lazy']

In [26]:
str1 = "we have a lazy cat"
result = re.findall(r"\w*z\w",str1)
result

['lazy']

In [27]:
str1 = "RudrANSHI_12345_wadekar"
result = re.findall(r"\w{1,}",str1)
result

['RudrANSHI_12345_wadekar']

In [29]:
str1 = "9821 maya"
result = re.findall(r"^\d*",str1)
result

['9821']

In [32]:
ip_adress="216.008.904.196"
result = re.sub(r"\b0.","",ip_adress)
result

'216.8.904.196'

In [37]:
str1="Python is required for data science version 3.2"
result = re.findall(r"\d..\b",str1)
result

['3.2']

In [38]:
str1 = "Exercises number 1, 12, 13, and 345 are important"
result = re.findall(r"\b\d{1,}\b",str1)
result

['1', '12', '13', '345']

In [39]:
Sample_text ='The quick brown fox jumps over the lazy dog.'
Searched_words ='fox', 'dog', 'horse'
for word in Searched_words:
    result = re.findall(word,Sample_text)
    print(result)

['fox']
['dog']
[]

In [40]:
sample_text ='The quick brown fox jumps over the lazy dog.'
result = re.search("fox",sample_text)
result

In [41]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
result

['exercises', 'exercises', 'exercises']

In [42]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
print(len(result))
result = re.search(r"exercises",Sample_text)
result

3

In [43]:
str1 = 'The quick brown fox jumps over the lazy dog.'
result = re.sub(r"[ ]","_",str1)
result

'The_quick_brown_fox_jumps_over_the_lazy_dog.'

In [44]:
result = re.sub(r"[_]"," ",str1)
result

'The quick brown fox jumps over the lazy dog.'

In [45]:
str1 = 'The quick brown fox jumps over the lazy dog.'
result = re.sub(r"[ ]","",str1)
result

'Thequickbrownfoxjumpsoverthelazydog.'

In [46]:
str1= "python and data science pythonnn"
result = re.findall(r"[p]\w*",str1)
result

['python', 'pythonnn']

In [47]:
str1= "data science and python learning with begening every evening "
result = re.findall(r"\b[a,e]\w*",str1)
result

['and', 'every', 'evening']

In [48]:
str1= "data science and python learning with begening every evening "
result = re.findall(r"\b[a,e]\w*",str1)
result

['and', 'every', 'evening']

In [49]:
str1 = "i am mrunal chaudhari ,my age is 24"
result = re.search(r"\d",str1)
result

In [50]:
text ="""Python. is a general,purpose, interpreted."""
result = re.sub(r"[,. ]",":",text)
result

'Python::is:a:general:purpose::interpreted:'

In [51]:
text ="""Python. is a general,purpose, interpreted."""
result = re.sub(r"[., ]",":",text)
result

'Python::is:a:general:purpose::interpreted:'

In [52]:
text ="""Python., is a general purpose interpreted."""
result = re.sub(r"[,. ]{2}",":",text)
result

'Python: is a general purpose interpreted.'

In [53]:
text ="""123 Python is a general-purpose, interpreted,
high-level programming language popularly used for
website development, data analytics 78 and automation."""
result = re.findall(r"\b\D{3,5}\b",text)
result

[' is a', 'high-', 'level', ' used', ' for\n', 'data ', ' and ']

In [54]:
text1 = '"Python", "Data", "Science"'
result = re.findall('""(.+?)""',text1)
result

[]

In [55]:
text ="""Python., is a general purpose interpreted."""
result = re.sub(r"[ ]+"," ",text)
result

'Python., is a general purpose interpreted.'

In [1]:
import numpy as np 
arr1 = np.zeros(10)
arr1

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [2]:
arr1.nbytes

80

In [3]:
arr1 = np.zeros(10)
arr1
arr1[4] = 1 
arr1

array([0., 0., 0., 0., 1., 0., 0., 0., 0., 0.])

In [1]:
import numpy as np 
arr1 = np.zeros(10)
arr1

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [2]:
arr1.nbytes

80

In [3]:
arr1 = np.zeros(10)
arr1
arr1[4] = 1 
arr1

array([0., 0., 0., 0., 1., 0., 0., 0., 0., 0.])

In [4]:
arr1 = np.arange(15,46)
arr1

array([15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
       32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45])

In [5]:
arr1

array([15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
       32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45])

In [6]:
arr1[::-1]

array([45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31, 30, 29,
       28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15])

In [8]:
result = reversed(arr1)
list(result)

[45,
 44,
 43,
 42,
 41,
 40,
 39,
 38,
 37,
 36,
 35,
 34,
 33,
 32,
 31,
 30,
 29,
 28,
 27,
 26,
 25,
 24,
 23,
 22,
 21,
 20,
 19,
 18,
 17,
 16,
 15]

In [11]:
arr1 = np.random.randint(10,20,size=(2,2))
print("Array1:\n",arr1)
arr2 = np.random.randint(20,30,size=(2,2))
print("Array2:\n",arr2)

Array1:
 [[12 17]
 [15 18]]
Array2:
 [[26 20]
 [21 20]]

In [12]:
result = arr1 + arr2
result

array([[38, 37],
       [36, 38]])

In [13]:
result = arr1 - arr2
result

array([[-14,  -3],
       [ -6,  -2]])

In [14]:
arr1 = np.array([1.3,1.8,2.3,3.9,1,4,1.9,9,.3])
arr1.round()

array([1., 2., 2., 4., 1., 4., 2., 9., 0.])

In [15]:
import math 
np.floor(arr1)

array([1., 1., 2., 3., 1., 4., 1., 9., 0.])

In [16]:
np.ceil(arr1)

array([2., 2., 3., 4., 1., 4., 2., 9., 1.])

In [17]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print("Array:\n", arr1)
result = np.mean(arr1,axis=1)
print("Mean across rows>>",result)
result = np.mean(arr1,axis=0)
print("Mean across columns>>",result)

Array:
 [[1 2 3]
 [4 5 6]
 [7 8 9]]
Mean across rows>> [2. 5. 8.]
Mean across columns>> [4. 5. 6.]

In [18]:
list1 = [0,30,45,60,90]
result = np.deg2rad(list1)
result

array([0.        , 0.52359878, 0.78539816, 1.04719755, 1.57079633])

In [19]:
arr1 = np.arange(9).reshape(3,3)
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [20]:
arr1 = np.random.randint(0,9,size=(3,3))
arr1

array([[7, 3, 0],
       [6, 2, 6],
       [0, 2, 6]])

In [21]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print("Array:\n",arr1)
arr1[:: , ::-1]

Array:
 [[1 2 3]
 [4 5 6]
 [7 8 9]]

array([[3, 2, 1],
       [6, 5, 4],
       [9, 8, 7]])

In [22]:
arr1

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [23]:
arr1[::-1]

array([[7, 8, 9],
       [4, 5, 6],
       [1, 2, 3]])

In [24]:
result = np.nonzero([1,2,0,0,4,0])
result

(array([0, 1, 4], dtype=int64),)

In [25]:
result = np.nonzero([1,2,0,0,4,0])
result

(array([0, 1, 4], dtype=int64),)

In [26]:
arr1 = np.array([[1,2],[3,4]])
print("Array:\n",arr1)
result = np.linalg.det(arr1)
result

Array:
 [[1 2]
 [3 4]]

-2.0000000000000004

In [27]:
arr1 = np.array([[2,3],[3,9]])
print("Array:\n",arr1)
result = np.linalg.inv(arr1)
result

Array:
 [[2 3]
 [3 9]]

array([[ 1.        , -0.33333333],
       [-0.33333333,  0.22222222]])

In [28]:
arr1 = np.random.randint(1,20,size=(30))
print("Array:\n",arr1)
result = np.mean(arr1)
result

Array:
 [ 6  9 19 19 19  6 11 17 16  3 13 16 10 10  2  1  9 15 13  9 19 10  3  7
 19  6  2 10 19  1]

10.633333333333333

In [29]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
print("Array:\n",arr1)
result = np.where(arr1 > 5)
result

Array:
 [ 1  2  3  4  5  6  7  8  9 10]

(array([5, 6, 7, 8, 9], dtype=int64),)

In [30]:
arr1 = np.random.random((3,3,3))
print("Array:\n",arr1)

Array:
 [[[0.59487441 0.10470628 0.19630545]
  [0.48752783 0.90303398 0.51110529]
  [0.70346214 0.68425929 0.25808126]]

 [[0.25234899 0.54977526 0.45515786]
  [0.31602833 0.15504699 0.49991841]
  [0.63350563 0.22009164 0.97653516]]

 [[0.45864587 0.34975451 0.33557396]
  [0.27850098 0.55769171 0.33318808]
  [0.12853448 0.09480222 0.79502277]]]

In [31]:
arr1 = np.random.rand(10,10)
print("Array:\n",arr1)
result = np.max(arr1)
print("Maximum value in array:\n",result)
result = np.min(result)
print("Minimum value in array:\n",result)

Array:
 [[0.60768949 0.21477441 0.43044449 0.48140477 0.21332489 0.31237459
  0.4726357  0.46995187 0.46015775 0.51681281]
 [0.83674729 0.10727582 0.0869472  0.77281595 0.17402325 0.05702164
  0.61224308 0.45064865 0.94006979 0.27320463]
 [0.17032929 0.39024288 0.18183465 0.72091063 0.91597449 0.07856401
  0.90375615 0.02900932 0.41784506 0.18088951]
 [0.53747388 0.03487239 0.5067705  0.21649717 0.73429934 0.87798074
  0.42099634 0.16010502 0.27387479 0.00384116]
 [0.32658915 0.58082562 0.20704161 0.22443299 0.64950537 0.58375517
  0.50645489 0.29138432 0.81334538 0.84676283]
 [0.67733278 0.81061013 0.49556459 0.66908069 0.0334447  0.25717894
  0.22143962 0.86679571 0.5258433  0.85260112]
 [0.98481872 0.81069538 0.60537727 0.39922127 0.44830902 0.43034817
  0.76985995 0.66338537 0.52484419 0.17228231]
 [0.6118914  0.02042501 0.38081139 0.00508157 0.2026035  0.58988996
  0.07762424 0.18135685 0.8305541  0.43877195]
 [0.2396931  0.7325198  0.63690484 0.25318448 0.03551107 0.2396754
  0.9358468  0.43972518 0.58337054 0.75178807]
 [0.40579203 0.22691975 0.09615909 0.19651004 0.54539856 0.39216815
  0.73493386 0.75407489 0.18192773 0.33453968]]
Maximum value in array:
 0.98481872426627
Minimum value in array:
 0.98481872426627

In [32]:
arr1 = np.ones((10,10))
print("Array:\n",arr1)
arr1[1:-1,1:-1] = 0 
arr1

Array:
 [[1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]]

array([[1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.]])

In [33]:
arr1 = np.zeros((5,5),dtype=int)
np.fill_diagonal(arr1[1:],[1,2,3,4,5])
arr1

array([[0, 0, 0, 0, 0],
       [1, 0, 0, 0, 0],
       [0, 2, 0, 0, 0],
       [0, 0, 3, 0, 0],
       [0, 0, 0, 4, 0]])

In [34]:
arr1 = np.zeros((5,5),dtype=int)
np.fill_diagonal(arr1[1:],[1,2,3,4,5])
arr1

array([[0, 0, 0, 0, 0],
       [1, 0, 0, 0, 0],
       [0, 2, 0, 0, 0],
       [0, 0, 3, 0, 0],
       [0, 0, 0, 4, 0]])

In [35]:
arr1 = np.eye(3,3)
arr1

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [36]:
arr1 = np.eye(4,4)
arr1

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [37]:
arr1 = np.random.randint(1,9,size=(5,3))
print("Array:\n",arr1)
arr2 = np.random.randint(1,9,size=(3,2))
print("Array:\n",arr2)
result = np.dot(arr1,arr2)
print("Multiplication of the array:\n",result)

Array:
 [[2 3 2]
 [5 4 1]
 [6 6 5]
 [3 7 6]
 [6 1 7]]
Array:
 [[7 7]
 [6 1]
 [3 3]]
Multiplication of the array:
 [[38 23]
 [62 42]
 [93 63]
 [81 46]
 [69 64]]

In [38]:
arr1 = np.array([1,2,3,4,5,6,7,8,8,9])
print("Array:\n",arr1)
result = np.where((arr1 >= 3) & (arr1 <= 8) , arr1*-1 , arr1)
result

Array:
 [1 2 3 4 5 6 7 8 8 9]

array([ 1,  2, -3, -4, -5, -6, -7, -8, -8,  9])

In [39]:
arr1 = np.array([[1.215413,2.654139],[3.4513056,5.2141555]])
print("Array:\n",arr1)
result = np.around(arr1,1)
result

Array:
 [[1.215413  2.654139 ]
 [3.4513056 5.2141555]]

array([[1.2, 2.7],
       [3.5, 5.2]])

In [41]:
arr1 = np.array([[1.215413,2.654139],[3.4513056,5.2141555]])
print("Array:\n",arr1)
result = np.ceil(arr1)
print("Rounded up :\n",result)
result = np.floor(arr1)
print("Rounded down :\n",result)

Array:
 [[1.215413  2.654139 ]
 [3.4513056 5.2141555]]
Rounded up :
 [[2. 3.]
 [4. 6.]]
Rounded down :
 [[1. 2.]
 [3. 5.]]

In [42]:
arr1 = np.array([1,2,3,4,5,6])
arr2 = np.array([4,5,6,7,8,9])
result = np.intersect1d(arr1,arr2)
result

array([4, 5, 6])

In [43]:
arr1 = np.linspace(0,1,10)[1:-1]
arr1

array([0.11111111, 0.22222222, 0.33333333, 0.44444444, 0.55555556,
       0.66666667, 0.77777778, 0.88888889])

In [44]:
arr1 = np.random.randint(1,10,size=10)
print("Array :\n",arr1)
result = np.sort(arr1)
print("Sorted array:",result)

Array :
 [4 4 5 1 5 5 8 1 7 9]
Sorted array: [1 1 4 4 5 5 5 7 8 9]

In [45]:
arr1 = np.zeros((5,5))
print("Array :\n",arr1)
result = arr1 + np.arange(5)
result

Array :
 [[0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]]

array([[0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.]])

In [46]:
arr1 = np.random.randint(0,5,size=5)
arr2 = np.random.randint(0,5,size=5)
if np.equal == True:
    print("Both arrays are equal")
else:
    print("Both arrays are not equal")

Both arrays are not equal

In [48]:
arr1 = np.random.randint(0,5,size=5)
arr2 = np.random.randint(0,5,size=5)
result = np.allclose(arr1,arr2)
result

False

In [3]:
import pandas as pd
import numpy as np
arr1 = np.random.randint(1,10,size=10)
print("Array :",arr1)
result = np.where(arr1 >= np.max(arr1) , 0, arr1)
result

Array : [7 5 6 1 3 1 9 3 5 6]

array([7, 5, 6, 1, 3, 1, 0, 3, 5, 6])

In [4]:
arr1 = np.array([[[1,2,3],[4,5,6],[7,8,9]]])
print("Array :",arr1)
for i in np.nditer(arr1):
    print(i , end=" ")

Array : [[[1 2 3]
  [4 5 6]
  [7 8 9]]]
1 2 3 4 5 6 7 8 9

In [5]:
arr1 = np.array([[[1,2,3],[4,5,6],[7,8,9]]])
print("Array :",arr1)
for i in np.nditer(arr1):
    print(i , end=" ")

Array : [[[1 2 3]
  [4 5 6]
  [7 8 9]]]
1 2 3 4 5 6 7 8 9

In [6]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
for index,value in np.ndenumerate(arr1):
    print(f"{index} index has {value} values")

(0, 0) index has 1 values
(0, 1) index has 2 values
(0, 2) index has 3 values
(1, 0) index has 4 values
(1, 1) index has 5 values
(1, 2) index has 6 values
(2, 0) index has 7 values
(2, 1) index has 8 values
(2, 2) index has 9 values

In [7]:
arr1 = np.random.randint(1,10,size=(3,3))
print("Array :\n",arr1)
result = (arr1[arr1[:,2].argsort()])
result

Array :
 [[7 1 4]
 [8 9 4]
 [7 6 9]]

array([[7, 1, 4],
       [8, 9, 4],
       [7, 6, 9]])

In [8]:
arr1 = np.array([[4,3,1],[5,8,9],[3,4,5]])
print("Array :\n",arr1)
arr1[[0,2]] = arr1[[2,0]]
arr1

Array :
 [[4 3 1]
 [5 8 9]
 [3 4 5]]

array([[3, 4, 5],
       [5, 8, 9],
       [4, 3, 1]])

In [9]:
arr1 = np.array([[4,3,1],[5,8,9],[3,4,5]])
print("Array :\n",arr1)
arr1[[0,2]] = arr1[[2,0]]
arr1

Array :
 [[4 3 1]
 [5 8 9]
 [3 4 5]]

array([[3, 4, 5],
       [5, 8, 9],
       [4, 3, 1]])

In [10]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
result = np.mean(arr1)
result

5.5

In [11]:
arr1

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [12]:
np.median(arr1)

5.5

In [13]:
arr1 = np.random.randint(1,10,size=10)
print("Array :\n",arr1)
result = np.std(arr1)
result

Array :
 [4 6 9 4 4 6 2 8 9 9]

2.4269322199023193

In [14]:
from scipy.stats import mode 
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
result = mode(arr1)
result

ModeResult(mode=1, count=1)

In [15]:
result = np.around(5.3425,1)
result

5.3

In [16]:
arr1 = np.array([[2,3],[3,4]])
print("Array :\n",arr1)
result = np.linalg.inv(arr1)
result

Array :
 [[2 3]
 [3 4]]

array([[-4.,  3.],
       [ 3., -2.]])

In [17]:
x = np.array([1,2,3])
y = np.array([4,5,6])
result = np.cov(x,y)
result

array([[1., 1.],
       [1., 1.]])

In [18]:
arr1 = np.array([1,1,2,2,3,4,5,6,7,8,9,6,4,3,6,7])
result = mode(arr1)[0]
result

6

In [19]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
print(arr1)
print("Dimension of the array:",arr1.ndim)
arr1.shape
arr2 = np.reshape(arr1 , (2,5,1))
print(arr2)
print("Dimension of the array:",arr2.ndim)

[ 1  2  3  4  5  6  7  8  9 10]
Dimension of the array: 1
[[[ 1]
  [ 2]
  [ 3]
  [ 4]
  [ 5]]

 [[ 6]
  [ 7]
  [ 8]
  [ 9]
  [10]]]
Dimension of the array: 3

In [20]:
arr1 = np.random.randint(1,20,size=(1,2,3,4))
print(arr1)
print("Dimension of the array:",arr1.ndim)
result = np.reshape(arr1 ,(6,4))
print(arr2)
print("Dimension of the array :",arr2.ndim)

[[[[13  6 19 16]
   [10 16 15  1]
   [19 11  5  6]]

  [[16  5  4 10]
   [15  2  2 11]
   [13  1 16 14]]]]
Dimension of the array: 4
[[[ 1]
  [ 2]
  [ 3]
  [ 4]
  [ 5]]

 [[ 6]
  [ 7]
  [ 8]
  [ 9]
  [10]]]
Dimension of the array : 3

In [21]:
arr1 = np.zeros(10,dtype=int)
arr1

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [22]:
arr1 = np.array([[1,2,3,4],[5,6,8,7],[3,4,5,6]])
print("Matrix :\n",arr1)
print("Shape of the array:",arr1.shape)

Matrix :
 [[1 2 3 4]
 [5 6 8 7]
 [3 4 5 6]]
Shape of the array: (3, 4)

In [1]:
import numpy as np 
import pandas as pd 
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
list1 = [[1,2,3],[4,5,6]]
pd.DataFrame(list1)

   0  1  2
0  1  2  3
1  4  5  6

In [3]:
df = pd.DataFrame(columns=list("ABC"),index=list("PQR"))
df

     A    B    C
P  NaN  NaN  NaN
Q  NaN  NaN  NaN
R  NaN  NaN  NaN

In [4]:
df = pd.DataFrame(columns=list("ABC"),index=list("PQR"))
if df.isnull:
    print("Dataframe is empty")
else:
    print("Dataframe is not empty")

Dataframe is empty

In [5]:
arr1 = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(arr1)
df

   0  1  2
0  1  2  3
1  4  5  6

In [6]:
list1 = [[1,2,3],[4,5,6]]
df = pd.DataFrame(list1)
df

   0  1  2
0  1  2  3
1  4  5  6

In [7]:
tuple1 = (1,2,3,4,5,6)
df = pd.DataFrame(tuple1)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [8]:
dict1 = {"name" : ["hindvi","ovi","rudu"] , "marks" : [80,70,90]}
df = pd.DataFrame(dict1)
df

     name  marks
0  hindvi     80
1     ovi     70
2    rudu     90

In [9]:
l1 = [[1,2,3],[4,5,6],[7,8,9]]
df = pd.DataFrame(l1,columns=list("ABC"))
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
df = pd.DataFrame(np.random.randint(10,40,size=(5,6)))
df

    0   1   2   3   4   5
0  19  36  20  37  17  12
1  36  30  15  20  15  36
2  17  37  26  38  17  38
3  25  27  25  15  26  22
4  26  22  16  27  21  11

In [11]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
df = pd.DataFrame(arr1)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
dict1 = {"name" : ["hindvi","ovi","rudu"] , "marks" : [80,70,90]}
df = pd.DataFrame(dict1)
df

     name  marks
0  hindvi     80
1     ovi     70
2    rudu     90

In [13]:
s1 = pd.Series([1,2,3,4,5,6])
s2 = s1.copy()
s2[0] = 50 
s1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [14]:
s2

0    50
1     2
2     3
3     4
4     5
5     6
dtype: int64

In [15]:
df = pd.DataFrame(np.full((4,5),6))
df["5"] = [1,2,3,4]
df

   0  1  2  3  4  5
0  6  6  6  6  6  1
1  6  6  6  6  6  2
2  6  6  6  6  6  3
3  6  6  6  6  6  4

In [16]:
df.loc[4] = [1,2,3,4,5,6]
df

   0  1  2  3  4  5
0  6  6  6  6  6  1
1  6  6  6  6  6  2
2  6  6  6  6  6  3
3  6  6  6  6  6  4
4  1  2  3  4  5  6

In [17]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
pd.DataFrame(arr1 , index=list("ABC"))

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [18]:
arr1 = np.random.randint(0,20,size=(4,4))
df = pd.DataFrame(arr1 , columns=list("ABCD"),index=list("PQRS"))
df.rename({"A":"a","B":"b","C":"c","D":"d"},axis=1,inplace=True)
df.rename({"P":"p","Q":"q","R":"r","S":"s"},axis=0,inplace=True)
df

    a   b   c   d
p   3  16  19  12
q   9  18   9  10
r  18   8  10  14
s   7  16  10  13

In [19]:
for i in df.items():
    print(i)

('a', p     3
q     9
r    18
s     7
Name: a, dtype: int32)
('b', p    16
q    18
r     8
s    16
Name: b, dtype: int32)
('c', p    19
q     9
r    10
s    10
Name: c, dtype: int32)
('d', p    12
q    10
r    14
s    13
Name: d, dtype: int32)

In [20]:
for i in df.iterrows():
    print(i)

('p', a     3
b    16
c    19
d    12
Name: p, dtype: int32)
('q', a     9
b    18
c     9
d    10
Name: q, dtype: int32)
('r', a    18
b     8
c    10
d    14
Name: r, dtype: int32)
('s', a     7
b    16
c    10
d    13
Name: s, dtype: int32)

In [22]:
df = pd.DataFrame(np.random.randint(10,20,size=(4,4)))
print(df)
arr1 = df.values
arr1

    0   1   2   3
0  15  15  13  13
1  13  14  19  14
2  12  18  18  14
3  18  12  13  12

array([[15, 15, 13, 13],
       [13, 14, 19, 14],
       [12, 18, 18, 14],
       [18, 12, 13, 12]])

In [23]:
df = pd.DataFrame(np.random.randint(10,20,size=(4,4)))
arr1 = df.values
arr1.tolist()

[[14, 19, 13, 19], [14, 17, 15, 13], [15, 17, 15, 12], [13, 11, 18, 14]]

In [24]:
df

    0   1   2   3
0  14  19  13  19
1  14  17  15  13
2  15  17  15  12
3  13  11  18  14

In [25]:
df.reset_index(drop=True)

    0   1   2   3
0  14  19  13  19
1  14  17  15  13
2  15  17  15  12
3  13  11  18  14

In [27]:
df = pd.DataFrame(np.random.randint(10,20,size=(4,5)))
print(df)
print(df.shape[0])
print(df.shape[1])

    0   1   2   3   4
0  11  16  18  19  13
1  14  17  14  15  16
2  12  11  10  12  11
3  18  11  11  15  13
4
5

In [28]:
s1 = pd.Series(np.arange(50,60))
s2 = pd.Series(np.arange(25,35))
result = s1+s2
result

0    75
1    77
2    79
3    81
4    83
5    85
6    87
7    89
8    91
9    93
dtype: int32

In [29]:
result = s1-s2
result

0    25
1    25
2    25
3    25
4    25
5    25
6    25
7    25
8    25
9    25
dtype: int32

In [30]:
result = s1 * s2
result

0    1250
1    1326
2    1404
3    1484
4    1566
5    1650
6    1736
7    1824
8    1914
9    2006
dtype: int32

In [31]:
result = s1 / s2
result

0    2.000000
1    1.961538
2    1.925926
3    1.892857
4    1.862069
5    1.833333
6    1.806452
7    1.781250
8    1.757576
9    1.735294
dtype: float64

In [32]:
df = pd.read_excel("Sample1.xlsx")
df

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587
3,4,Kathleen,Hanner,Female,United States,25,15/10/2017,3549
4,5,Nereida,Magwood,Female,United States,58,16/08/2016,2468
...,...,...,...,...,...,...,...,...
995,996,Roma,Lafollette,Female,United States,34,15/10/2017,2654
996,997,Felisa,Cail,Female,United States,28,16/08/2016,6525
997,998,Demetria,Abbey,Female,United States,32,21/05/2015,3265
998,999,Jeromy,Danz,Male,United States,39,15/10/2017,3265
999,1000,Rasheeda,Alkire,Female,United States,29,16/08/2016,6125

In [33]:
df.head(3)

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587

In [34]:
df[["First Name","Last Name"]]

    First Name   Last Name
0        Dulce       Abril
1         Mara   Hashimoto
2       Philip        Gent
3     Kathleen      Hanner
4      Nereida     Magwood
..         ...         ...
995       Roma  Lafollette
996     Felisa        Cail
997   Demetria       Abbey
998     Jeromy        Danz
999   Rasheeda      Alkire

[1000 rows x 2 columns]

In [35]:
df = pd.DataFrame(np.arange(1,8))
df

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7

In [36]:
df = pd.read_csv("diabetes.csv")
df.head(3)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1

In [37]:
df["Age"].mean()

33.243489583333336

In [38]:
df["Age"].sum()

25531

In [39]:
df["Age"].min()

21

In [40]:
df["Age"].max()

81

In [41]:
df = pd.DataFrame(np.random.randint(1,10,size=(5,4)))
df

   0  1  2  3
0  4  8  6  2
1  1  3  9  2
2  9  8  2  1
3  1  6  2  5
4  2  2  2  4

In [42]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [43]:
df.groupby(df["Embarked"]).get_group("S")

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [45]:
arr1 = np.random.randint(1,20,size=(4,2))
df = pd.DataFrame(arr1)
df.apply(np.sqrt)

          0         1
0  3.872983  4.242641
1  2.449490  1.414214
2  3.000000  3.872983
3  4.123106  4.242641

In [46]:
df = pd.DataFrame(np.random.randint(1,9,size=(3,4)))
df

   0  1  2  3
0  5  3  8  3
1  3  2  2  7
2  7  3  3  7

In [47]:
df.apply(lambda x : x**2)

    0  1   2   3
0  25  9  64   9
1   9  4   4  49
2  49  9   9  49

In [48]:
df.apply(lambda x : x**3)

     0   1    2    3
0  125  27  512   27
1   27   8    8  343
2  343  27   27  343

In [49]:
arr1 = np.random.randint(1,20,size=(4,2))
df = pd.DataFrame(arr1)
print(df)
df.apply(lambda x : x**2)

    0   1
0  18   3
1  13  14
2   2   3
3   6  19

     0    1
0  324    9
1  169  196
2    4    9
3   36  361

In [50]:
df = pd.read_csv("diabetes.csv")
df.head(3)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 8 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Glucose                   768 non-null    int64
 1   BloodPressure             768 non-null    int64
 2   SkinThickness             768 non-null    int64
 3   Insulin                   768 non-null    int64
 4   BMI                       768 non-null    float64
 5   DiabetesPedigreeFunction  768 non-null    float64
 6   Age                       768 non-null    int64
 7   Outcome                   768 non-null    int64
dtypes: float64(2), int64(6)
memory usage: 48.1 KB

In [52]:
df.describe()

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,121.117188,69.076823,20.536458,79.799479,31.992578,0.471876,33.243490,0.348958
std,31.805091,19.367794,15.952218,115.244002,7.884160,0.331329,11.758182,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,142.000000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [53]:
df.head(2)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0

In [54]:
df.tail(2)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
766,126,60,0,0,30.1,0.349,47,1
767,93,70,31,0,30.4,0.315,23,0

In [55]:
data1 = {"NAME" : ["Rudranshi","Sanvi","Swati","Shiva"]}
df = pd.DataFrame(data1)
print(df)
df["NAME"].apply(lambda x : x.istitle())

        NAME
0  Rudranshi
1      Sanvi
2      Swati
3      Shiva

0    True
1    True
2    True
3    True
Name: NAME, dtype: bool

In [56]:
d1 = {"Employee":["Saniya","Sara","Alexa","Jenny"]}
df = pd.DataFrame(d1)
d2 = {"Saniya": "Software Developer" , "Sara":"Developer" , "Alexa":"Assistant"}
print(df)
df["Designation"] = df["Employee"].map(d2)
df

  Employee
0   Saniya
1     Sara
2    Alexa
3    Jenny

  Employee         Designation
0   Saniya  Software Developer
1     Sara           Developer
2    Alexa           Assistant
3    Jenny                 NaN

In [57]:
arr1 = np.random.randint(1,10,size=(5,5))
df = pd.DataFrame(arr1 , columns=list("ABCDE"))
df

   A  B  C  D  E
0  4  8  5  9  8
1  2  2  8  5  2
2  1  6  1  5  4
3  8  2  6  6  8
4  8  6  3  9  3

In [58]:
df["F"] = [1,2,3,4,5]
df

   A  B  C  D  E  F
0  4  8  5  9  8  1
1  2  2  8  5  2  2
2  1  6  1  5  4  3
3  8  2  6  6  8  4
4  8  6  3  9  3  5

In [59]:
df.insert(1,"H",[1,2,1,2,1])
df

   A  H  B  C  D  E  F
0  4  1  8  5  9  8  1
1  2  2  2  8  5  2  2
2  1  1  6  1  5  4  3
3  8  2  2  6  6  8  4
4  8  1  6  3  9  3  5

In [60]:
df

   A  H  B  C  D  E  F
0  4  1  8  5  9  8  1
1  2  2  2  8  5  2  2
2  1  1  6  1  5  4  3
3  8  2  2  6  6  8  4
4  8  1  6  3  9  3  5

In [61]:
df.drop("A",axis=1,inplace=True)
df

   H  B  C  D  E  F
0  1  8  5  9  8  1
1  2  2  8  5  2  2
2  1  6  1  5  4  3
3  2  2  6  6  8  4
4  1  6  3  9  3  5

In [65]:
df.drop(2,axis=0,inplace=True)
df

KeyError: '[2] not found in axis'

In [66]:
df

   H  B  C  D  E  F
0  1  8  5  9  8  1
1  2  2  8  5  2  2
3  2  2  6  6  8  4
4  1  6  3  9  3  5

In [67]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([4,5,6,7,8])
s11 = set(s1)
s22 = set(s2)
result = s11.symmetric_difference(s22)
final = pd.Series(list(result))
final

0    1
1    2
2    3
3    6
4    7
5    8
dtype: int64

In [68]:
s1 = pd.Series([1,2,3,4,5])
print("Median :",s1.median())
print("Mean:",s1.mean())
print("25th percentile:",s1.quantile(0.25))
print("75th percentile:",s1.quantile(0.75))
print("Maximum :",s1.max())

Median : 3.0
Mean: 3.0
25th percentile: 2.0
75th percentile: 4.0
Maximum : 5

In [69]:
df = pd.DataFrame(np.random.randint(10,50,size=(4,4)) , columns=list("CABD") , index=list("xzvs"))
df

    C   A   B   D
x  45  22  28  41
z  37  11  38  30
v  46  39  45  16
s  11  45  48  39

In [70]:
df.sort_index()

    C   A   B   D
s  11  45  48  39
v  46  39  45  16
x  45  22  28  41
z  37  11  38  30

In [71]:
df.sort_index(axis=1)

    A   B   C   D
x  22  28  45  41
z  11  38  37  30
v  39  45  46  16
s  45  48  11  39

In [72]:
df.sort_values("D")

    C   A   B   D
v  46  39  45  16
z  37  11  38  30
s  11  45  48  39
x  45  22  28  41

In [73]:
df = pd.DataFrame({"A" : [1,1,3,4,5],
                   "B" : [1,1,3,4,5],
                   "C" : [1,1,3,4,5],
                   "D" : [1,1,3,4,5]})
df

   A  B  C  D
0  1  1  1  1
1  1  1  1  1
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5

In [74]:
df.drop_duplicates()

   A  B  C  D
0  1  1  1  1
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5

In [75]:
df.drop("A",axis=1,inplace=True)

In [76]:
df

   B  C  D
0  1  1  1
1  1  1  1
2  3  3  3
3  4  4  4
4  5  5  5

In [77]:
data = {'Full Name': ['John Doe', 'Jane Smith', 'Bob Johnson']}
df = pd.DataFrame(data)

df[["First Name","Last Name"]] = df["Full Name"].str.split(expand=True)
df

     Full Name First Name Last Name
0     John Doe       John       Doe
1   Jane Smith       Jane     Smith
2  Bob Johnson        Bob   Johnson

In [78]:
data = {'Full Name': ['John Doe', 'Jane Smith', 'Bob Johnson']}
df = pd.DataFrame(data)

df[["First Name","Last Name"]] = df["Full Name"].str.split(expand=True)
df

     Full Name First Name Last Name
0     John Doe       John       Doe
1   Jane Smith       Jane     Smith
2  Bob Johnson        Bob   Johnson

In [2]:
import pandas as pd 
import numpy as np 
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [3]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            180
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
df["Age"].fillna(df["Age"].mean(),inplace=True)
df["Age"].isna().sum()

0

In [5]:
movie_dict = {"Movies":["Interstellar","Avengers","Dhoom","Interstellar"],
"Genre":["fiction","Fiction","Comedy","fiction"],
"Actors":["American","French","Indian","American"]}
index_labels = ["a","b","c","d"]
df = pd.DataFrame(movie_dict,index=index_labels)
df

         Movies    Genre    Actors
a  Interstellar  fiction  American
b      Avengers  Fiction    French
c         Dhoom   Comedy    Indian
d  Interstellar  fiction  American

In [6]:
df

         Movies    Genre    Actors
a  Interstellar  fiction  American
b      Avengers  Fiction    French
c         Dhoom   Comedy    Indian
d  Interstellar  fiction  American

In [8]:
df.head(3)

         Movies    Genre    Actors
a  Interstellar  fiction  American
b      Avengers  Fiction    French
c         Dhoom   Comedy    Indian

In [9]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [10]:
df.loc[:1 , ["Name","Age","Gender"]]

                                                Name   Age  Gender
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female

In [11]:
df.loc[[0,1,2,3,4,5] , ["Name","Age","Gender"]]

                                                Name   Age  Gender
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                             Heikkinen, Miss. Laina   NaN  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)   NaN  female
4                           Allen, Mr. William Henry   NaN    male
5                                   Moran, Mr. James   NaN    male

In [12]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [13]:
df.isna()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,True,False,False,False,False,True,False
3,False,False,False,False,False,True,False,False,False,False,False,False
4,False,False,False,False,False,True,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [14]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,True,False,False,False,False,True,False
3,False,False,False,False,False,True,False,False,False,False,False,False
4,False,False,False,False,False,True,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [15]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            180
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [16]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [17]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            180
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [18]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            180
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [19]:
df.dropna()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [20]:
df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [21]:
df.dropna()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [22]:
df.isna().sum().sum()

869

In [23]:
df["Age"].isna().sum()

180

In [24]:
df["Age"].fillna(40,inplace=True)
df["Age"].isna().sum()

0

In [25]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [26]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            180
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [27]:
df["Age"].fillna(df["Age"].mean(),inplace=True)
df["Age"].isna().sum()

0

In [28]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [29]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            180
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [30]:
df["Age"].isna().to_numpy().nonzero()

(array([  2,   3,   4,   5,  17,  19,  26,  28,  29,  31,  32,  36,  42,
         45,  46,  47,  48,  55,  64,  65,  76,  77,  82,  87,  95, 101,
        107, 109, 121, 126, 128, 140, 154, 158, 159, 166, 168, 176, 180,
        181, 185, 186, 196, 198, 201, 214, 223, 229, 235, 240, 241, 250,
        256, 260, 264, 270, 274, 277, 284, 295, 298, 300, 301, 303, 304,
        306, 324, 330, 334, 335, 347, 351, 354, 358, 359, 364, 367, 368,
        375, 384, 388, 409, 410, 411, 413, 415, 420, 425, 428, 431, 444,
        451, 454, 457, 459, 464, 466, 468, 470, 475, 481, 485, 490, 495,
        497, 502, 507, 511, 517, 522, 524, 527, 531, 533, 538, 547, 552,
        557, 560, 563, 564, 568, 573, 578, 584, 589, 593, 596, 598, 601,
        602, 611, 612, 613, 629, 633, 639, 643, 648, 650, 653, 656, 667,
        669, 674, 680, 692, 697, 709, 711, 718, 727, 732, 738, 739, 740,
        760, 766, 768, 773, 776, 778, 783, 790, 792, 793, 815, 825, 826,
        828, 832, 837, 839, 846, 849, 859, 863, 868, 878, 888], dtype=int64),)

In [31]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [33]:
female = df.groupby(df["Gender"]).get_group("female")
female

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [34]:
s = df.groupby(df["Embarked"]).get_group("S")
s

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [35]:
df.head(4)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S

In [36]:
df = pd.read_csv("diabetes.csv")
df.head(4)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1
3,150,66,23,94,28.1,0.167,21,0

In [39]:
df.loc[: , ["Age","BMI","Glucose"]]

     Age   BMI  Glucose
0     50  33.6      148
1     31  26.6       85
2     52  23.3      183
3     21  28.1      150
4     33  43.1      150
..   ...   ...      ...
763   63  32.9      101
764   27  36.8      122
765   30  26.2      121
766   47  30.1      126
767   23  30.4       93

[768 rows x 3 columns]

In [3]:
import pandas as pd 
import numpy as np
df = pd.read_csv("titanic.csv")
df.reindex(["Age","Outcome","BMI"],axis=1)

      Age  Outcome  BMI
0    22.0      NaN  NaN
1    38.0      NaN  NaN
2     NaN      NaN  NaN
3     NaN      NaN  NaN
4     NaN      NaN  NaN
..    ...      ...  ...
886  27.0      NaN  NaN
887  19.0      NaN  NaN
888   NaN      NaN  NaN
889  26.0      NaN  NaN
890  32.0      NaN  NaN

[891 rows x 3 columns]

In [4]:
df = pd.read_csv("student.csv")
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [5]:
df.loc[35] = [36,"Honny","five",45,"male"]
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
35  36        Honny   five    45    male

In [6]:
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [7]:
df.drop((df.loc[(df["mark"] < 50)]).index)

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [8]:
df.drop((df.loc[(df["mark"] < 50)]).index)

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [9]:
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [10]:
df.iloc[[5] , ]

   id       name class  mark gender
5   6  Alex John  Four    55   male

In [11]:
df.iloc[:5]

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [12]:
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [13]:
class1 = {class1 : len(class1) for class1 in df["class"]}
class1

{'Four': 4,
 'Three': 5,
 'Fifth': 5,
 'Five': 4,
 'Six': 3,
 'Seven': 5,
 'Nine': 4,
 'Eight': 5,
 'five': 4}

In [16]:
class1 = {class1 : len(class1) for class1 in df["class"]}
class1

{'Four': 4,
 'Three': 5,
 'Fifth': 5,
 'Five': 4,
 'Six': 3,
 'Seven': 5,
 'Nine': 4,
 'Eight': 5,
 'five': 4}

In [17]:
df["name"] = pd.DataFrame(df["name"].apply(lambda x : x.swapcase()))
df

    id         name  class  mark  gender
0    1     jOHN dEO   Four    75  female
1    2     mAX rUIN  Three    85    male
2    3       aRNOLD  Three    55    male
3    4   kRISH sTAR   Four    60  female
4    5    jOHN mIKE   Four    60  female
5    6    aLEX jOHN   Four    55    male
6    7  mY jOHN rOB  Fifth    78    male
7    8       aSRUID   Five    85    male
8    9      tES qRY    Six    78    male
9   10     bIG jOHN   Four    55  female
10  11       rONALD    Six    89  female
11  12        rECKY    Six    94  female
12  13          kTY  Seven    88  female
13  14         bIGY  Seven    88  female
14  15     tADE rOW   Four    88    male
15  16        gIMMY   Four    88    male
16  17        tUMYU    Six    54    male
17  18        hONNY   Five    75    male
18  19        tINNY   Nine    18    male
19  20       jACKLY   Nine    65  female
20  21   bABBY jOHN   Four    69  female
21  22       rEGGID  Seven    55  female
22  23        hEROD  Eight    79    male
23  24    tIDDY nOW  Seven    78    male
24  25     gIFF tOW  Seven    88    male
25  26       cRELEA  Seven    79    male
26  27     bIG nOSE  Three    81  female
27  28    rOJJ bASE  Seven    86  female
28  29  tESS pLAYED  Seven    55    male
29  30    rEPPY rED    Six    79  female
30  31  mARRY tOEEY   Four    88    male
31  32    bINN rOTT  Seven    90  female
32  33    kENN rEIN    Six    96  female
33  34     gAIN tOE  Seven    69    male
34  35   rOWS nOUMP    Six    88  female
35  36        hONNY   five    45    male

In [18]:
df["name"] = pd.DataFrame(df["name"].apply(lambda x : x.swapcase()))
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
35  36        Honny   five    45    male

In [19]:
df["name"] = df["name"].apply(lambda x : x.lower())
df

    id         name  class  mark  gender
0    1     john deo   Four    75  female
1    2     max ruin  Three    85    male
2    3       arnold  Three    55    male
3    4   krish star   Four    60  female
4    5    john mike   Four    60  female
5    6    alex john   Four    55    male
6    7  my john rob  Fifth    78    male
7    8       asruid   Five    85    male
8    9      tes qry    Six    78    male
9   10     big john   Four    55  female
10  11       ronald    Six    89  female
11  12        recky    Six    94  female
12  13          kty  Seven    88  female
13  14         bigy  Seven    88  female
14  15     tade row   Four    88    male
15  16        gimmy   Four    88    male
16  17        tumyu    Six    54    male
17  18        honny   Five    75    male
18  19        tinny   Nine    18    male
19  20       jackly   Nine    65  female
20  21   babby john   Four    69  female
21  22       reggid  Seven    55  female
22  23        herod  Eight    79    male
23  24    tiddy now  Seven    78    male
24  25     giff tow  Seven    88    male
25  26       crelea  Seven    79    male
26  27     big nose  Three    81  female
27  28    rojj base  Seven    86  female
28  29  tess played  Seven    55    male
29  30    reppy red    Six    79  female
30  31  marry toeey   Four    88    male
31  32    binn rott  Seven    90  female
32  33    kenn rein    Six    96  female
33  34     gain toe  Seven    69    male
34  35   rows noump    Six    88  female
35  36        honny   five    45    male

In [21]:
df["name"] = df["name"].apply(lambda x : x.title())
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
35  36        Honny   five    45    male

In [22]:
list1 = ['Amir ',' Ashwin',' Bhakti ',' Amol','Aishwarya ','Satyam ']
s1 = pd.Series(list1)
s1

0         Amir
1        Ashwin
2       Bhakti
3          Amol
4    Aishwarya
5       Satyam
dtype: object

In [23]:
s1 = s1.apply(lambda x : x.strip())
s1

0         Amir
1       Ashwin
2       Bhakti
3         Amol
4    Aishwarya
5       Satyam
dtype: object

In [24]:
list1 = ['Amir ',' Ashwin',' Bhakti ',' Amol','Aishwarya ','Satyam ']
s1 = pd.Series(list1)
s1

0         Amir
1        Ashwin
2       Bhakti
3          Amol
4    Aishwarya
5       Satyam
dtype: object

In [25]:
s1 = s1.apply(lambda x : x.strip())
s1

0         Amir
1       Ashwin
2       Bhakti
3         Amol
4    Aishwarya
5       Satyam
dtype: object

In [26]:
s1.to_numpy().tolist()

['Amir', 'Ashwin', 'Bhakti', 'Amol', 'Aishwarya', 'Satyam']

In [27]:
data = {'year': [1700, 1850, 2000, 2300, 1950]}
df = pd.DataFrame(data)

result = df[(df["year"] >= 1800) & (df["year"] <= 2200)]
result

   year
1  1850
2  2000
4  1950

In [28]:
df1 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('ABC'),index=list('pqr'))
df2 = pd.DataFrame(np.random.randint(100,1000,(4,4)),columns=list('ABCD'),index=list('pqrs'))
df1

   A  B  C
p  3  6  5
q  1  4  6
r  2  2  9

In [30]:
df2

     A    B    C    D
p  680  934  300  891
q  652  959  737  660
r  542  790  978  689
s  236  169  776  110

In [31]:
pd.concat([df1,df2])

     A    B    C      D
p    3    6    5    NaN
q    1    4    6    NaN
r    2    2    9    NaN
p  680  934  300  891.0
q  652  959  737  660.0
r  542  790  978  689.0
s  236  169  776  110.0

In [32]:
pd.concat([df1,df2],axis=1)

     A    B    C    A    B    C    D
p  3.0  6.0  5.0  680  934  300  891
q  1.0  4.0  6.0  652  959  737  660
r  2.0  2.0  9.0  542  790  978  689
s  NaN  NaN  NaN  236  169  776  110

In [33]:
df1=pd.DataFrame({"Name":["Aarathi","Veena","Lakshmipriya","Sriyan"],
"Age":[23,54,34,67],
"Location":["Pune","Bangalore","Pune","Kochi"]})
df2=pd.DataFrame({"Name":["Aara","Anupama","Robin","Dilsha","Ramya"],
"Age":[23,54,34,67,45],
"Maths":[34,45,50,49,46],
"English":[50,49,48,34,89],
"Hindi":[40,45,50,34,67]})
df3=pd.DataFrame({"Name":["Aarathi","Veena","Sriyan","Dilsha","Arohi"],
"Salary":[80000,70000,90000,780000,90000]})
df1

           Name  Age   Location
0       Aarathi   23       Pune
1         Veena   54  Bangalore
2  Lakshmipriya   34       Pune
3        Sriyan   67      Kochi

In [34]:
df2

      Name  Age  Maths  English  Hindi
0     Aara   23     34       50     40
1  Anupama   54     45       49     45
2    Robin   34     50       48     50
3   Dilsha   67     49       34     34
4    Ramya   45     46       89     67

In [35]:
df3

      Name  Salary
0  Aarathi   80000
1    Veena   70000
2   Sriyan   90000
3   Dilsha  780000
4    Arohi   90000

In [36]:
result = pd.concat([df1,df2])
result

           Name  Age   Location  Maths  English  Hindi
0       Aarathi   23       Pune    NaN      NaN    NaN
1         Veena   54  Bangalore    NaN      NaN    NaN
2  Lakshmipriya   34       Pune    NaN      NaN    NaN
3        Sriyan   67      Kochi    NaN      NaN    NaN
0          Aara   23        NaN   34.0     50.0   40.0
1       Anupama   54        NaN   45.0     49.0   45.0
2         Robin   34        NaN   50.0     48.0   50.0
3        Dilsha   67        NaN   49.0     34.0   34.0
4         Ramya   45        NaN   46.0     89.0   67.0

In [37]:
result = pd.merge(result , df3 , on="Name")
result

      Name  Age   Location  Maths  English  Hindi  Salary
0  Aarathi   23       Pune    NaN      NaN    NaN   80000
1    Veena   54  Bangalore    NaN      NaN    NaN   70000
2   Sriyan   67      Kochi    NaN      NaN    NaN   90000
3   Dilsha   67        NaN   49.0     34.0   34.0  780000

In [38]:
df1 = pd.DataFrame({"Name":["Aarathi","Veena","Lakshmipriya","Amit","Sriyan"],
"ID_card":['BSL004','BSL006','BSL010','BSL003','BSL007'],
"Physics":[94,86,73,96,75],
"Cemistry":[85,91,89,78,81]})
df2 = pd.DataFrame({"Name":["Aarathi","Veena","Manoj","Lakshmipriya","Sriyan"],
"ID_card":['BSL001','BSL005','BSL009','BSL008','BSL002'],
"Maths":[88,72,69,97,45],
"Biology":[98,75,86,61,64]})
df1

           Name ID_card  Physics  Cemistry
0       Aarathi  BSL004       94        85
1         Veena  BSL006       86        91
2  Lakshmipriya  BSL010       73        89
3          Amit  BSL003       96        78
4        Sriyan  BSL007       75        81

In [39]:
df2

           Name ID_card  Maths  Biology
0       Aarathi  BSL001     88       98
1         Veena  BSL005     72       75
2         Manoj  BSL009     69       86
3  Lakshmipriya  BSL008     97       61
4        Sriyan  BSL002     45       64

In [40]:
result = pd.merge(df1 , df2 , on="Name" , suffixes=["_df1","_df2"])
result

           Name ID_card_df1  Physics  Cemistry ID_card_df2  Maths  Biology
0       Aarathi      BSL004       94        85      BSL001     88       98
1         Veena      BSL006       86        91      BSL005     72       75
2  Lakshmipriya      BSL010       73        89      BSL008     97       61
3        Sriyan      BSL007       75        81      BSL002     45       64

In [42]:
df1

           Name ID_card  Physics  Cemistry
0       Aarathi  BSL004       94        85
1         Veena  BSL006       86        91
2  Lakshmipriya  BSL010       73        89
3          Amit  BSL003       96        78
4        Sriyan  BSL007       75        81

In [43]:
df2

           Name ID_card  Maths  Biology
0       Aarathi  BSL001     88       98
1         Veena  BSL005     72       75
2         Manoj  BSL009     69       86
3  Lakshmipriya  BSL008     97       61
4        Sriyan  BSL002     45       64

In [44]:
result = pd.merge(df1 , df2 , how="left")
result

           Name ID_card  Physics  Cemistry  Maths  Biology
0       Aarathi  BSL004       94        85    NaN      NaN
1         Veena  BSL006       86        91    NaN      NaN
2  Lakshmipriya  BSL010       73        89    NaN      NaN
3          Amit  BSL003       96        78    NaN      NaN
4        Sriyan  BSL007       75        81    NaN      NaN

In [45]:
result = pd.merge(df1,df2,how="left",on="Name" , suffixes=["_df1","_df2"])
result

           Name ID_card_df1  Physics  Cemistry ID_card_df2  Maths  Biology
0       Aarathi      BSL004       94        85      BSL001   88.0     98.0
1         Veena      BSL006       86        91      BSL005   72.0     75.0
2  Lakshmipriya      BSL010       73        89      BSL008   97.0     61.0
3          Amit      BSL003       96        78         NaN    NaN      NaN
4        Sriyan      BSL007       75        81      BSL002   45.0     64.0

In [46]:
result = pd.merge(df1,df2,how="right",on="Name",suffixes=["_df1","_df2"])
result

           Name ID_card_df1  Physics  Cemistry ID_card_df2  Maths  Biology
0       Aarathi      BSL004     94.0      85.0      BSL001     88       98
1         Veena      BSL006     86.0      91.0      BSL005     72       75
2         Manoj         NaN      NaN       NaN      BSL009     69       86
3  Lakshmipriya      BSL010     73.0      89.0      BSL008     97       61
4        Sriyan      BSL007     75.0      81.0      BSL002     45       64

In [47]:
english_df = pd.DataFrame({'Name':['Amir','Salman','Maaz','Tanvir','Fahad'],
'Surname':['Arkar','Mulla','Surve','Kadvekar','Antule'],
'Marks':[94,86,91,93,88]})
maths_df = pd.DataFrame({'Name':['Amir','Salman','Maaz','Tanvir','Fahad'],
'Surname':['Khan','Mulla','Hafiz','Kadvekar','Shaikh'],
'Marks':[91,89,93,87,84]})
english_df

     Name   Surname  Marks
0    Amir     Arkar     94
1  Salman     Mulla     86
2    Maaz     Surve     91
3  Tanvir  Kadvekar     93
4   Fahad    Antule     88

In [48]:
maths_df

     Name   Surname  Marks
0    Amir      Khan     91
1  Salman     Mulla     89
2    Maaz     Hafiz     93
3  Tanvir  Kadvekar     87
4   Fahad    Shaikh     84

In [49]:
result = pd.merge(english_df , maths_df , how="inner" , on=["Name","Surname"],suffixes=["_df1","_df2"])
result

     Name   Surname  Marks_df1  Marks_df2
0  Salman     Mulla         86         89
1  Tanvir  Kadvekar         93         87

In [50]:
physics_df = pd.DataFrame({'Name_1':['Amir','Salman','Maaz','Karim','Fahad'],
'Surname':['Arkar','Mulla','Surve','Kadvekar','Antule'],
'Marks':[94,86,91,93,88]})
chemistry_df = pd.DataFrame({'Name_2':['Asif','Salman','Maaz','Tanvir','Fahad'],
'Surname':['Khan','Mulla','Hafiz','Rawal','Shaikh'],
'Marks':[91,89,93,87,84]})
physics_df

   Name_1   Surname  Marks
0    Amir     Arkar     94
1  Salman     Mulla     86
2    Maaz     Surve     91
3   Karim  Kadvekar     93
4   Fahad    Antule     88

In [51]:
chemistry_df

   Name_2 Surname  Marks
0    Asif    Khan     91
1  Salman   Mulla     89
2    Maaz   Hafiz     93
3  Tanvir   Rawal     87
4   Fahad  Shaikh     84

In [52]:
result = pd.merge(physics_df,chemistry_df,how="inner",left_on="Name_1",right_on="Name_2",suffixes=["_1","_2"])
result

   Name_1 Surname_1  Marks_1  Name_2 Surname_2  Marks_2
0  Salman     Mulla       86  Salman     Mulla       89
1    Maaz     Surve       91    Maaz     Hafiz       93
2   Fahad    Antule       88   Fahad    Shaikh       84

In [53]:
df = pd.read_csv("movies_data.csv")
df.head(3)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."

In [54]:
result = df.sort_values("duration",ignore_index=True,ascending=False)
result

,star_rating,title,content_rating,genre,duration,actors_list
0,7.8,Hamlet,PG-13,Drama,242,"[u'Kenneth Branagh', u'Julie Christie', u'Dere..."
1,8.2,Gone with the Wind,G,Drama,238,"[u'Clark Gable', u'Vivien Leigh', u'Thomas Mit..."
2,8.4,Once Upon a Time in America,R,Crime,229,"[u'Robert De Niro', u'James Woods', u'Elizabet..."
3,8.3,Lagaan: Once Upon a Time in India,PG,Adventure,224,"[u'Aamir Khan', u'Gracy Singh', u'Rachel Shell..."
4,7.9,The Ten Commandments,APPROVED,Adventure,220,"[u'Charlton Heston', u'Yul Brynner', u'Anne Ba..."
...,...,...,...,...,...,...
974,8.1,Duck Soup,PASSED,Comedy,68,"[u'Groucho Marx', u'Harpo Marx', u'Chico Marx']"
975,8.4,The Kid,NOT RATED,Comedy,68,"[u'Charles Chaplin', u'Edna Purviance', u'Jack..."
976,8.1,The Cabinet of Dr. Caligari,UNRATED,Crime,67,"[u'Werner Krauss', u'Conrad Veidt', u'Friedric..."
977,8.0,Battleship Potemkin,UNRATED,History,66,"[u'Aleksandr Antonov', u'Vladimir Barsky', u'G..."
978,8.0,Freaks,UNRATED,Drama,64,"[u'Wallace Ford', u'Leila Hyams', u'Olga Bacla..."

In [55]:
result = df["duration"].max()
result

242

In [56]:
result = df["duration"].min()
result

64

In [57]:
result = df.loc[(df["genre"] == "Action") | (df["genre"] == "Crime")].reset_index(drop=True)
\result

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
255,7.4,La Femme Nikita,R,Action,118,"[u'Anne Parillaud', u'Marc Duret', u'Patrick F..."
256,7.4,The Rock,R,Action,136,"[u'Sean Connery', u'Nicolas Cage', u'Ed Harris']"
257,7.4,Law Abiding Citizen,R,Crime,109,"[u'Gerard Butler', u'Jamie Foxx', u'Leslie Bibb']"
258,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
259,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [58]:
result = df.loc[(df["genre"] == "Action") | (df["genre"] == "Crime").reset_index(drop=True)]
result

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
963,7.4,La Femme Nikita,R,Action,118,"[u'Anne Parillaud', u'Marc Duret', u'Patrick F..."
967,7.4,The Rock,R,Action,136,"[u'Sean Connery', u'Nicolas Cage', u'Ed Harris']"
969,7.4,Law Abiding Citizen,R,Crime,109,"[u'Gerard Butler', u'Jamie Foxx', u'Leslie Bibb']"
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [59]:
city_df = pd.DataFrame({'Name':['Amir','Shaibaz','Suhel','Fahad','Adil','Muzaffar','Shuaib','Asif','Awez','Muzammil'],
'City':['Georgia','California','Los Angeles','California','Los Angeles','Georgia','Los Angeles',
'California','Los Angeles','California']})
city_df

       Name         City
0      Amir      Georgia
1   Shaibaz   California
2     Suhel  Los Angeles
3     Fahad   California
4      Adil  Los Angeles
5  Muzaffar      Georgia
6    Shuaib  Los Angeles
7      Asif   California
8      Awez  Los Angeles
9  Muzammil   California

In [60]:
city_df.groupby(city_df["City"]).size().reset_index(name = "Number of people")

          City  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [61]:
df = pd.read_csv("Bengaluru_House_Data.csv")
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.00

In [62]:
df.fillna(40)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,40,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,40,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,40,3600,5.0,40.0,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,40,550,1.0,1.0,17.00

In [63]:
df.replace({np.nan : 0})

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,0,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,0,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,0,3600,5.0,0.0,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,0,550,1.0,1.0,17.00

In [64]:
df = pd.DataFrame({'col1':[1,4,3,4,5],
'col2':[4,5,6,7,8],
'col3':[7,8,9,0,1]})
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [65]:
result = df.drop([0,2,4])
result

   col1  col2  col3
1     4     5     8
3     4     7     0

# What are the key features of python?
* Python is a versatile and popular programming language known for its simplicity and readability.
1. Easy to read syntax : Python uses a clean and easilt readable syntax,which makes it beginneer friendly and reduces the cost of program maintenance.
2. Dynamically typed language : You dont need to declare variables explicitlty.Variables can hold values of any types and their types can change during runtime.
3. Interpreted language : Code is executed line by line at runtime.This allows for faster development cycle and easier debugging.
4. Large standard library :

In [1]:
import pandas as pd 
df = pd.read_csv("covid_data.csv")
df

,location,date,new_cases,new_deaths,population,aged_65_older_percent,gdp_per_capita,hospital_beds_per_thousand
0,Afghanistan,2019-12-31,0,0,38928341.0,2.581,1803.987,0.5
1,Afghanistan,2020-01-01,0,0,38928341.0,2.581,1803.987,0.5
2,Afghanistan,2020-01-02,0,0,38928341.0,2.581,1803.987,0.5
3,Afghanistan,2020-01-03,0,0,38928341.0,2.581,1803.987,0.5
4,Afghanistan,2020-01-04,0,0,38928341.0,2.581,1803.987,0.5
...,...,...,...,...,...,...,...,...
23077,International,2020-02-28,0,0,NaN,NaN,NaN,NaN
23078,International,2020-02-29,0,2,NaN,NaN,NaN,NaN
23079,International,2020-03-01,0,0,NaN,NaN,NaN,NaN
23080,International,2020-03-02,0,0,NaN,NaN,NaN,NaN
23081,International,2020-03-10,-9,1,NaN,NaN,NaN,NaN

In [3]:
df1 = pd.read_csv("cardio_base.csv")
df1

          id    age  gender  height  weight  ap_hi  ap_lo  cholesterol  smoke
0          0  18393       2     168    62.0    110     80            1      0
1          1  20228       1     156    85.0    140     90            3      0
2          2  18857       1     165    64.0    130     70            3      0
3          3  17623       2     169    82.0    150    100            1      0
4          4  17474       1     156    56.0    100     60            1      0
...      ...    ...     ...     ...     ...    ...    ...          ...    ...
69995  99993  19240       2     168    76.0    120     80            1      1
69996  99995  22601       1     158   126.0    140     90            2      0
69997  99996  19066       2     183   105.0    180     90            3      0
69998  99998  22431       1     163    72.0    135     80            1      0
69999  99999  20540       1     170    72.0    120     80            2      0

[70000 rows x 9 columns]

In [1]:
import pandas as pd 
df = pd.read_csv("diabetes.csv")
df

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1
3,150,66,23,94,28.1,0.167,21,0
4,150,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...
763,101,76,48,180,32.9,0.171,63,0
764,122,70,27,0,36.8,0.340,27,0
765,121,72,23,112,26.2,0.245,30,0
766,126,60,0,0,30.1,0.349,47,1
767,93,70,31,0,30.4,0.315,23,0

In [1]:
input_user = input("Enter a string:")
for i in input_user:
    print(i)

A
b
h
i
s
h
e
k

In [2]:
string = "Machine Learning"
result = len(string)
result

16

In [3]:
string = "Machine Learning"
count1 = 0 
for i in string:
    count1 += 1
count1

16

In [4]:
sentence = "This is orange juice"
keyword = "orange"

if keyword in sentence:
    print("Orange is present in sentence")
else:
    print("Orange is not present in sentence")

Orange is present in sentence

In [5]:
input_user = input("Enter a string:")
vowels = "aeiou"
consonants = "bcdfghjklmnpqrstvwxyz"
digits = "0123456789"
vowel_count = 0 
consonant_count = 0
digit_count = 0
whitespace_count = 0
for i in input_user:
    if i.lower() in vowels:
        vowel_count += 1
    elif i.lower() in consonants:
        consonant_count += 1
    elif i.lower() in digits:
        digit_count += 1
    elif i.isspace():
        whitespace_count += 1
print("Vowels count : ", vowel_count)
print("Consonant count : ", consonant_count)
print("Digit count : ", digit_count)
print("Whitespace count : ", whitespace_count)

Vowels count :  7
Consonant count :  10
Digit count :  0
Whitespace count :  1

In [6]:
input_user = input("Enter a string:")
uppercase_count = 0 
lowercase_count = 0 
special_count = 0
numeric_count = 0
for i in input_user:
    if i.islower():
        lowercase_count += 1
    elif i.isupper():
        uppercase_count += 1
    elif i.isdigit():
        numeric_count += 1
    else:
        special_count += 1
print("Upper case count: ", uppercase_count)
print("Lower case count: ",lowercase_count)
print("Special count: ",special_count)
print("Number of digits: ",numeric_count)

Upper case count:  2
Lower case count:  15
Special count:  1
Number of digits:  0

In [7]:
input_string = "Hello,have a good day"
vowels = "aeiouAEIOU"
new_string = ""
for i in input_string:
    if i.isalpha() and i in vowels:
        new_string += i 
print("original string:",input_string)
print("New string with consonants deleted:",new_string)

original string: Hello,have a good day
New string with consonants deleted: eoaeaooa

In [8]:
input_string = input("Enter a non empty string")
index = int(input("Enter the index of the character to be removed"))

if index < 0 or index > len(input_string):
    print("Invalid Index")
else:
    new_string = input_string[:index] + input_string[index+1:]
    print("Original string: ", input_string)
    print("New string with index removed: ", new_string)

Original string:  Abhishek
New string with index removed:  Abhshek

In [9]:
input_string = input("Enter a string:")
if len(input_string) < 2:
    print("String should have at least 2 characters")
else:
    new_string = input_string[-1] + input_string[1:-1] + input_string[0]
    print("Original string: ", input_string)
    print("String with first and last characters exchanged: ", new_string)

Original string:  Abhishek
String with first and last characters exchanged:  kbhisheA

In [10]:
input_string = str(input("Enter a string:"))
new_string = ""
for i in input_string:
    new_string = i 
    count1 = input_string.count(new_string)
    print(f"In the given string {new_string} is been repeated {count1} times")

In the given string A is been repeated 1 times
In the given string b is been repeated 1 times
In the given string h is been repeated 2 times
In the given string i is been repeated 1 times
In the given string s is been repeated 1 times
In the given string h is been repeated 2 times
In the given string e is been repeated 1 times
In the given string k is been repeated 1 times

In [12]:
input_string = str(input("ENter a string:"))
split1 = input_string.split(input_string)
for i in split1:
    if i in split1:
        split1.count(i)
        print(f"{i} : {input_string.count(i)}")
    else:
        print("Word is not repeated")

 : 9
 : 9

In [13]:
s = str(input("Enter a string:"))
ss = s.split(i)
for i in ss:
    if i in ss:
        ss.count(i)
        print(f"{i} : {s.count(i)}")
    else:
        print("Word is not repeated")

ValueError: empty separator

In [14]:
input_string = input("Enter a string:")
result = input_string[-10:]
result

' Wakchaure'

In [15]:
input_string = input("Enter a string:")
uppercase_count = 0 
for i in input_string[:4]:
    if i.isupper():
        uppercase_count += 1
if uppercase_count >= 2:
    uppercase_string = input_string.upper()
    print("Uppercase string:",uppercase_string)
else:
    print("No conversion required")

No conversion required

In [17]:
input_string = "This is a string with a newline.\n"
result = input_string.replace("\n","")
print("Original string:",input_string)
print("New string without newline:",result)

Original string: This is a string with a newline.

New string without newline: This is a string with a newline.

In [18]:
input_string = "32.054,23"
result = input_string.replace(",","*").replace(".",",").replace("*",".")
result

'32,054.23'

In [20]:
input_string = input("Enter a string:")
char_count = {}
for i in input_string:
    if i in char_count:
        print("First repeated character:",i)
        break
    char_count[i] = 1
else:
    print("No repeated character found")

First repeated character: h

In [21]:
input_string = input("Enter a string:")
even_count = 0 
odd_count = 0

for i in input_string:
    if i.isdigit():
        num = int(i)
        if num % 2 == 0:
            even_count += 1
        else:
            odd_count += 1
print("Even numbers count :",even_count)
print("odd number count :",odd_count)

Even numbers count : 4
odd number count : 5

In [2]:
input_string = input("Enter a string:")
even_count = 0 
odd_count = 0
for i in input_string:
    if i.isdigit():
        num = int(i)
        if num % 2 == 0:
            even_count += 1
        else:
            odd_count += 1
print("Even numbers count :",even_count)
print("odd number count :",odd_count)

Even numbers count : 3
odd number count : 3

In [3]:
input_string = input("Enter a string:")
if input_string.isdigit() == True:
    print("String contains only digits")
else:
    print("String contains alphabetes")

String contains alphabetes

In [7]:
a = "Abhishek"
List = list(a)
print(List)
x = input("")
if x in List:
    List.remove(x)
    print(List)
else:
    print("Character not found")
List

['A', 'b', 'h', 'i', 's', 'h', 'e', 'k']
['A', 'b', 'h', 's', 'h', 'e', 'k']

['A', 'b', 'h', 's', 'h', 'e', 'k']

In [8]:
a = "Abhishek"
k = []
for i in a:
    if a.index(i)%2!=0:
        k.append(i)
k

['b', 'i', 'k']

In [9]:
a = "Abhishek"
k = []
for i in a:
    if a.index(i)%2!=0:
        k.append(i)
k

['b', 'i', 'k']

In [11]:
input_string = input("Enter a string:")
if len(input_string) % 5 == 0:
    new_string = input_string[::-1]
    print(new_string)
else:
    print("length is not multiple of 5")

length is not multiple of 5

In [12]:
input_string = str(input("Enter a string:"))
empty = []
for i in input_string:
    empty = input_string[::-1]
empty

'kehsihbA'

In [13]:
input_string = str(input("Enter a string"))
result = input_string.replace(" ","")
result

'AbhishekWakchaure'

In [14]:
input_string = str(input("Enter a string:"))
result = []
for i in input_string:
    if i not in result:
        result.append(i)
result

['A', 'b', 'h', 'i', 's', 'e', 'k']

In [15]:
num = eval(input("Enter a number:"))
for i in range(0 , num+1):
    print(i*i)

0
1
4
9
16
25
36
49
64
81
100

In [16]:
num = eval(input("Enter a number:"))
for i in range(0 , num+1):
    print(i*i*i)

0
1
8
27
64
125
216
343
512
729
1000

In [17]:
num = eval(input("Enter a number:"))
for i in range(2 , num):
    if num % i == 0:
        print("Not prime")
        break
    else:
        print("Prime number")
        break

Not prime

In [18]:
input_string = str(input("Enter a string:"))
for i in input_string:
    print(i)

A
b
h
i
s
h
e
k

In [1]:
list1 = [1,2,3,4,5]
result = max(list1)
result

5

In [2]:
list1 = [1,2,3,4,5]
list1.sort()
list1
result = list1[-1]
result

5

In [3]:
list1 = [1,2,3,4,5]
list1.sort(reverse=True)
result = list1[0]
result

5

In [5]:
list1 = [1,2,3,4,5]
result = list1[-1:] + list1[1:-1] + list1[:1]
result

[5, 2, 3, 4, 1]

In [6]:
list1 = [1,2,3,4,5]
list1[0],list1[1] = list1[1],list1[0]
list1

[2, 1, 3, 4, 5]

In [7]:
list1 = [1,2,3,4,5]
list1.reverse()
list1

[5, 4, 3, 2, 1]

In [10]:
list1 = [1,2,3,4,5]
result = reversed(list1)
list(result)

[5, 4, 3, 2, 1]

In [12]:
list1 = [1,2,1,2,1,1,1,3,4,4]
list1.count(1)

5

In [13]:
list1 = [1,2,1,2,1,1,1,3,4,4]
num = 1
count1 = 0
for i in list1:
    if i == num:
        count1 += 1
count1

5

In [14]:
list1 = [1,2,3,4,5]
sum1 = 0 
for i in list1:
    sum1 += i 
sum1

15

In [15]:
list1 = [1,2,3,4,5]
mul = 1
for i in list1:
    mul *= i 
mul

120

In [16]:
list1 = [1,2,3,4,5]
len(list1)

5

In [17]:
list1 = [1,2,3,4,5]
print(range(len(list1)))

range(0, 5)

In [18]:
list1 = [1,2,3,4,5]
count1 = 0
for i in list1:
    count1 += 1
count1

5

In [19]:
list1 = []
num = int(input("How many numbers you want in the list?"))
for i in range(num):
    item = int(input("Enter the item you want in the list:"))
    list1.append(item)
print("List1 is :", list1)

num1 = int(input("Enter the number you want to remove from the list:"))
for i in range(len(list1)):
    if num1 == list1[i]:
        list1.remove(num1)
        print("Deleted number you want from list:", num1)
        print(list1)
        break
    else:
        print("Number not found in the list")

List1 is : [1, 2, 3, 4, 5]
Number not found in the list
Number not found in the list
Deleted number you want from list: 3
[1, 2, 4, 5]

In [20]:
list1 = [2,5,6,12]
list2 = []
for i in list1:
    list2.append(i**2)
print("Original list: ", list1)
print("Square list: ", list2)

Original list:  [2, 5, 6, 12]
Square list:  [4, 25, 36, 144]

In [21]:
list1 = [2,5,6,12]
list2 = []
list2 = [(i**2) for i in list1]
list2

[4, 25, 36, 144]

In [22]:
even_numbers = []
odd_numbers = []
for i in range(0 , 152):
    if i % 2 == 0:
        even_numbers.append(i)
    else:
        odd_numbers.append(i)
print("Even numbers: ", even_numbers)
print("*"*380)
print("Odd numbers: ", odd_numbers)

Even numbers:  [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150]
********************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************
Odd numbers:  [1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123, 125, 127, 129, 131, 133, 135, 137, 139, 141, 143, 145, 147, 149, 151]

In [23]:
even_numbers = []
even_count = 0 
odd_numbers = []
odd_count = 0
for i in range(0 , 152):
    if i % 2 == 0:
        even_numbers.append(i)
        even_count += 1
    else:
        odd_numbers.append(i)
        odd_count += 1
print("Even numbers:", even_numbers)
print("*"*500)
print("Even count of numbers:", even_count)
print()
print()
print("Odd numbers:", odd_numbers)
print("*"*500)
print("Odd count of numbers:", odd_count)

Even numbers: [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150]
********************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************
Even count of numbers: 76


Odd numbers: [1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123, 125, 127, 129, 131, 133, 135, 137, 139, 141, 143, 145, 147, 149, 151]
********************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************
Odd count of numbers: 76

In [24]:
l1=[1,2,3,"hello","welcome",4.12,5.35]
int_list = []
string_list = []
float_list = []
for i in l1:
    if type(i) == int:
        int_list.append(i)
    elif type(i) == float:
        float_list.append(i)
    elif type(i) == str:
        string_list.append(i)
print("Integer list: ", int_list)
print()
print("Float list: ", float_list)
print()
print("String list: ", string_list)

Integer list:  [1, 2, 3]

Float list:  [4.12, 5.35]

String list:  ['hello', 'welcome']

In [25]:
l1=[1,2,3,4]
l2=[4,5,6,7]
l2.extend(l1)
l2

[4, 5, 6, 7, 1, 2, 3, 4]

In [26]:
l1=[10, 2, 4, 5, 6, 2, 9, 1, 7, 5, 4, 11, 30]
result = sorted(l1,reverse=True)
result[2]

10

In [27]:
l1=[1,2,3,4,1,2,3,4]
l2 = {}
for i in l1:
    if i in l2:
        l2[i] = l2[i] + 1
    else:
        l2[i] = 1
l2

{1: 2, 2: 2, 3: 2, 4: 2}

In [28]:
l1=[1,2,3,4,1,2,3,4]
l2 = {}
for i in l1:
    if i in l2:
        l2[i] = l2[i] + 1
    else:
        l2[i] = 1
l2

{1: 2, 2: 2, 3: 2, 4: 2}

In [29]:
l1=[[1,2,3,4],1,2,3,4]
l2=[1,2,3,4]
if l2 in l1:
    print("L2 is subset of l1")
else:
    print("L2 is not a subset of l1")

L2 is subset of l1

In [30]:
l1=[10,20,30,40]
l2=[10,20,30,50]
result = set(l1) & set(l2)
result

{10, 20, 30}

In [31]:
l1=[[1,2,3],[4,5,6],[7,8,9]]
from itertools import chain
result = list(chain(*l1))
result

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [33]:
tuple1 = (2,5,3,1,6,8,4)
result = sorted(tuple1)
tuple(result)

(1, 2, 3, 4, 5, 6, 8)

In [34]:
l1 = [11, 33, 50]
for i in l1:
    print(i , end="")

113350

In [35]:
l1 = [1]
if l1 == []:
    print("List is empty")
else:
    print("List is not empty")

List is not empty

In [36]:
l1=[1,2,3]
l2=[4,5,6]
l1 + l2

[1, 2, 3, 4, 5, 6]

In [37]:
l1=[1,2,3,1,2,3,4,5,6,4,5,6]
l1.count(1)

2

In [38]:
l1=[[1,2,3],[4,5,6],[7,8,9]]
from itertools import chain
result = list(chain(*l1))
result

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [1]:
key_value={'l':11,'o':89,'a':88,'d':42,'p':5}
result = dict(sorted(key_value.items()))
result

{'a': 88, 'd': 42, 'l': 11, 'o': 89, 'p': 5}

In [2]:
key_value={'l':11,'o':89,'a':88,'d':42,'p':5}
result = dict(sorted(key_value.items()))
result

{'a': 88, 'd': 42, 'l': 11, 'o': 89, 'p': 5}

In [3]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
result = dict(sorted(dt.items() , key=lambda x : x[1]))
result

{'cc': 3, 'bb': 6, 'dd': 12, 'aa': 44}

In [5]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
result = dict(sorted(dt.items() , key=lambda x : x[1]))
result

{'cc': 3, 'bb': 6, 'dd': 12, 'aa': 44}

In [6]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
result = dt.values()
sum(result)

65

In [7]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
sum1 = 0
for i in dt.values():
    sum1 += i 
sum1

65

In [8]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
del test_dict["Arushi"]
test_dict

{'Mani': 21, 'Haritha': 21}

In [10]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
del test_dict["Mani"]
test_dict

{'Arushi': 22, 'Haritha': 21}

In [11]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
test_dict.pop("Mani")

21

In [12]:
test_dict

{'Arushi': 22, 'Haritha': 21}

In [13]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
result = {**d1 , **d2}
result

{'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32,
 'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12}

In [14]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
result = {**d2 , **d1}
result

{'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12,
 'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32}

In [16]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
d1.update(d2)
d1

{'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32,
 'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12}

In [17]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
d2.update(d1)
d2

{'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12,
 'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32}

In [18]:
def calc(percent):
    if percent >= 90:
        return "A+"
    elif 80 <= percent < 90:
        return "A"
    elif 70 <= percent < 80:
        return "B"
    elif 60 <= percent < 70:
        return "C"
    elif 50 <= percent < 60:
        return "D"
    else:
        return "Fail"

def main():
    total_marks = 0
    no_of_subjects = int(input("Enter the number of subjects:"))

    for i in range(no_of_subjects):
        marks = eval(input("Enter the mark of the subject:"))
        total_marks += marks

    average_percent = total_marks / no_of_subjects
    grade = calc(average_percent)
    print(f"Percentage recieved by the student is : {average_percent}")
    print(f"Grade recieved by Student is :{grade}")
if __name__ == "__main__":
    main()

Percentage recieved by the student is : 70.0
Grade recieved by Student is :B

In [19]:
words = ["listen", "silent", "enlist", "hello", "world", "act", "cat", "dog", "god"]
anagram_dict = {}
for word in words:
    sorted_word = " ".join(sorted(word))

    if sorted_word in anagram_dict:
        anagram_dict[sorted_word].append(word)
    else:
        anagram_dict[sorted_word] = [word]

anagram_dict

{'e i l n s t': ['listen', 'silent', 'enlist'],
 'e h l l o': ['hello'],
 'd l o r w': ['world'],
 'a c t': ['act', 'cat'],
 'd g o': ['dog', 'god']}

In [20]:
words = ["listen", "silent", "enlist", "hello", "world", "act", "cat", "dog", "god"]
anagram_dict = {}

for word in words:
    sorted_word = " ".join(sorted(word))

    if sorted_word in anagram_dict:
        anagram_dict[sorted_word].append(word)
    else:
        anagram_dict[sorted_word] = [word]
anagram_dict

{'e i l n s t': ['listen', 'silent', 'enlist'],
 'e h l l o': ['hello'],
 'd l o r w': ['world'],
 'a c t': ['act', 'cat'],
 'd g o': ['dog', 'god']}

In [21]:
def check_bin(num1,num2):
    binary_num1 = bin(num1)[2:]
    binary_num2 = bin(num2)[2:]

    return sorted(binary_num1) == sorted(binary_num2)
num1 = 10 
num2 = 10

if check_bin(num1,num2):
    print(f"The Binary representation of {num1} and {num2} are anagrams")
else:
    print(f"The Binary representation of {num1} and {num2} are not anagrams")

The Binary representation of 10 and 10 are anagrams

In [22]:
from collections import Counter
def largest(words):
    words_count = Counter("".join(sorted(word)) for word in words)

    result = max(words_count.values(),default=0)

    return result

word_list = ["listen", "silent", "enlist", "dog", "god", "good"]
final = largest(word_list)
final

3

In [23]:
list1 = [1, 1, 1, 5, 5, 3, 1, 3, 3, 1,4, 4, 4, 2, 2, 2, 2]
freq = {}
for i in list1:
    if i in freq:
        freq[i] += 1
    else:
        freq[i] = 1
freq

{1: 5, 5: 2, 3: 3, 4: 3, 2: 4}

In [24]:
list1 = [1, 1, 1, 5, 5, 3, 1, 3, 3, 1,4, 4, 4, 2, 2, 2, 2]
freq = {}
for i in list1:
    if i in freq:
        freq[i] += 1
    else:
        freq[i] = 1
freq

{1: 5, 5: 2, 3: 3, 4: 3, 2: 4}

In [25]:
tups = [("akash", 10), ("gaurav", 12), ("anand", 14), 
    ("suraj", 20), ("akhil", 25), ("ashish", 30)]
result = dict(tups)
result

{'akash': 10,
 'gaurav': 12,
 'anand': 14,
 'suraj': 20,
 'akhil': 25,
 'ashish': 30}

In [26]:
numbers = [2, 3, 4, 5, 6]
result = [(num ** 2) for num in numbers]
result

[4, 9, 16, 25, 36]

In [27]:
tuples_list = [(2, 8), (3, 27), (1, 1), (5, 125), (4, 64)]
result = sorted(tuples_list , key=lambda x : x[1])
result

[(1, 1), (2, 8), (3, 27), (4, 64), (5, 125)]

In [1]:
subject_marks = [("English",88) , ("Science",90) , ("Maths",97) , ("Social sciences",82)]
result = list(sorted(subject_marks,key=lambda x : x[1]))
result

[('Social sciences', 82), ('English', 88), ('Science', 90), ('Maths', 97)]

In [2]:
subject_marks = [("English",88) , ("Science",90) , ("Maths",97) , ("Social sciences",82)]
result = list(sorted(subject_marks,key=lambda x : x[0]))
result

[('English', 88), ('Maths', 97), ('Science', 90), ('Social sciences', 82)]

In [3]:
list1 = [{"name" : "Nandini" , "age" : 20} ,
        {"name" : "Manjeet" , "age" : 20} ,
        {"name" : "Nikhil" , "age" : 19}]
result = list(sorted(list1,key=lambda x : x["age"]))
result

[{'name': 'Nikhil', 'age': 19},
 {'name': 'Nandini', 'age': 20},
 {'name': 'Manjeet', 'age': 20}]

In [4]:
list1 = [{"name" : "Nandini" , "age" : 20} ,
        {"name" : "Manjeet" , "age" : 20} ,
        {"name" : "Nikhil" , "age" : 19}]
result = list(sorted(list1,key=lambda x : (x["age"],x["name"])))
result

[{'name': 'Nikhil', 'age': 19},
 {'name': 'Manjeet', 'age': 20},
 {'name': 'Nandini', 'age': 20}]

In [5]:
list1 = [{"name" : "Nandini" , "age" : 20} ,
        {"name" : "Manjeet" , "age" : 20} ,
        {"name" : "Nikhil" , "age" : 19}]
result = list(sorted(list1,key=lambda x : (x["age"]),reverse=True))
result

[{'name': 'Nandini', 'age': 20},
 {'name': 'Manjeet', 'age': 20},
 {'name': 'Nikhil', 'age': 19}]

In [6]:
input_numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [(lambda x : x**2)(num) for num in input_numbers]
result

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [7]:
input_numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [(lambda x : x**3)(num) for num in input_numbers]
result

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [8]:
result = lambda x : True if x.startswith("P") else False
print(result("Python"))

True

In [9]:
result = lambda x : True if x.startswith("n") else False
print(result("Python"))

False

In [10]:
result = (lambda string : string.isdigit()) (string = "1234")
result

True

In [11]:
result = (lambda string : string.isdecimal())(string = "1234")
result

True

In [12]:
result = (lambda string : string.isnumeric())(string = "1234")
result

True

In [13]:
n = 10 
f1 = 0 
f2 = 1
print(f1,f2,end=" ")
for i in range(2,n):
    f3 = f1 + f2
    f1,f2 = f2,f3
    print(f3,end=" ")

0 1 1 2 3 5 8 13 21 34

In [14]:
n = 5 
f1 = 0 
f2 = 1
print(f1,f2,end=" ")
for i in range(2,n):
    f3 = f1 + f2
    f1,f2 = f2,f3
    print(f3,end=" ")

0 1 1 2 3

In [15]:
list1 = [1,2,3,4]
list2 = [3,4,5,6]
result = list(filter(lambda x : x in list1,list2))
result

[3, 4]

In [16]:
list1 = [1,2,3,4]
list2 = [3,4,5,6]
result = list(filter(lambda x : x in list2,list1))
result

[3, 4]

In [18]:
list1 = [-1,2,-3,5,7,8,9,-10]
result = lambda list1 : [x for x in list1 if x >= 0] + [x for x in list1 if x < 0]
final = result(list1)
final

[2, 5, 7, 8, 9, -1, -3, -10]

In [19]:
list1 = [-1,2,-3,5,7,8,9,-10]
result = lambda list1 : [x for x in list1 if x >= 0] + [x for x in list1 if x < 0]
final = result(list1)
final

[2, 5, 7, 8, 9, -1, -3, -10]

In [20]:
array_nums = [1,2,3,5,7,8,9,10]
odd_count = len(list(filter(lambda x : (x%2!=0),array_nums)))
odd_count

5

In [21]:
even_count = len(list(filter(lambda x : (x%2==0),array_nums)))
even_count

3

In [22]:
list1 = [1,2,3]
list2 = [4,5,6]
result = list(map(lambda x1,x2 : x1+x2,list1,list2))
result

[5, 7, 9]

In [23]:
list1 = [13,26,38,39,57,15,17]
result = list(filter(lambda x : (x%19==0 or x%13==0),list1))
result

[13, 26, 38, 39, 57]

In [24]:
texts = ["php" , "w3r" , "Python" , "abcd" ,"Java" , "aaa"]
result = list(filter(lambda x : (x == "".join(reversed(x))),texts))
result

['php', 'aaa']

In [25]:
texts = ["php" , "w3r" , "Python" , "abcd" ,"Java" , "aaa"]
result = list(filter(lambda x : (x=="".join(reversed(x))),texts))
result

['php', 'aaa']

In [26]:
from collections import Counter
texts = ["bcda","abce","cbda","cbea","adcb"]
str1 = "abcd"
result = list(filter(lambda x : (Counter(str1) == Counter(x)),texts))
result

['bcda', 'cbda', 'adcb']

In [27]:
from collections import Counter
texts = ["bcda","abce","cbda","cbea","adcb"]
str1 = "abcd"
result = list(filter(lambda x : (Counter(str1) == Counter(x)),texts))
result

['bcda', 'cbda', 'adcb']

In [28]:
list1 = [2,3,4,5]
result = list(map(lambda x : x*5,list1))
result

[10, 15, 20, 25]

In [29]:
list1 = [-1,-2,3,4]
positive = list(filter(lambda list1 : list1 > 0,list1))
negative = list(filter(lambda list1 : list1 < 0,list1))
sum(positive)

7

In [30]:
sum(negative)

-3

In [31]:
list1 = [[0],[1,3],[5,7],[9,11],[13,15,17]]
result = max(list1,key=lambda x : len(x))
result

[13, 15, 17]

In [32]:
list1 = [[0],[1,3],[5,7],[9,11],[13,15,17]]
result = min(list1,key=lambda x : len(x))
result

[0]

In [35]:
sample_list_1 = [1, 2, 3, 4, 5]
sample_list_2 = [5, 3, 1, 4, 2]
result = lambda list1 : list1 == sorted(list1)
final = result(sample_list_1)
final

True

In [36]:
sample_list_1 = [1, 2, 3, 4, 5]
sample_list_2 = [5, 3, 1, 4, 2]
result = lambda list1 : list1 == sorted(list1)
final = result(sample_list_2)
final

False

In [37]:
list1 = [1,2,3,4,5,6,7,8,9,10]
list2 = [2,4,6,8]
result = list(filter(lambda x : x not in list2,list1))
result

[1, 3, 5, 7, 9, 10]

In [38]:
list1 = [1,2,3,4,5,6,7,8,9,10]
list2 = [2,4,6,8]
result = list(filter(lambda x : x not in list1,list2))
result

[]

In [40]:
tuple_str = (("223","ABCD","33") , ("1416","EFGH","55") , ("2345","WERT","34"))
result = tuple(map(lambda x : (int(x[0]),int(x[2])),tuple_str))
result

((223, 33), (1416, 55), (2345, 34))

In [41]:
tuple_str = (("223","ABCD","33") , ("1416","EFGH","55") , ("2345","WERT","34"))
result = tuple(map(lambda x : (int(x[0]),int(x[2])),tuple_str))
result

((223, 33), (1416, 55), (2345, 34))

In [42]:
nums = [3,4,5,8,0,3,8,5,0,3,1,5,2,3,4,2]
result = dict(map(lambda x : (x,list(nums).count(x)),nums))
result

{3: 4, 4: 2, 5: 3, 8: 2, 0: 2, 1: 1, 2: 2}

In [43]:
nums = [3,4,5,8,0,3,8,5,0,3,1,5,2,3,4,2]
result = dict(map(lambda x : (x,list(nums).count(x)),nums))
result

{3: 4, 4: 2, 5: 3, 8: 2, 0: 2, 1: 1, 2: 2}

In [44]:
l1 = [1,2,3]
l2 = [4,5,6]
l3 = [7,8,9]
result = list(map(lambda x1,x2,x3 : x1+x2+x3,l1,l2,l3))
result

[12, 15, 18]

In [45]:
l1 = [1,2,3]
l2 = [4,5,6]
l3 = [7,8,9]
result = list(map(lambda x1,x2,x3 : x1+x2+x3,l1,l2,l3))
result

[12, 15, 18]

In [46]:
l1 = ["yellow","blue","tricolor"]
result = list(map(list,l1))
result

[['y', 'e', 'l', 'l', 'o', 'w'],
 ['b', 'l', 'u', 'e'],
 ['t', 'r', 'i', 'c', 'o', 'l', 'o', 'r']]

In [47]:
l1 = ["yellow","blue","tricolor"]
result = list(map(list,l1))
result

[['y', 'e', 'l', 'l', 'o', 'w'],
 ['b', 'l', 'u', 'e'],
 ['t', 'r', 'i', 'c', 'o', 'l', 'o', 'r']]

In [48]:
l1 = [12,15,18]
result = list(map(lambda x : x**2,l1))
result

[144, 225, 324]

In [49]:
list1 = [1, 2, 3, 4, 5]
list2 = [5, 4, 3, 2, 1]
result = list(map(lambda x1,x2 : x1+x2,list1,list2))
result

[6, 6, 6, 6, 6]

In [50]:
list1 = [1, 2, 3, 4, 5]
list2 = [5, 4, 3, 2, 1]
result = list(map(lambda x1,x2 : x1-x2,list1,list2))
result

[-4, -2, 0, 2, 4]

In [51]:
# Given list of integers
int_list = [1, 2, 3, 4, 5]

# Given tuple of integers
int_tuple = (6, 7, 8, 9, 10)

result = list(map(lambda x : str(x),int_list))
result

['1', '2', '3', '4', '5']

In [52]:
# Given list of integers
int_list = [1, 2, 3, 4, 5]

# Given tuple of integers
int_tuple = (6, 7, 8, 9, 10)

result = list(map(lambda x : str(x),int_tuple))
result

['6', '7', '8', '9', '10']

In [53]:
num_array = [1, 2, 3, 4, 5]

result = sum(list(map(lambda x : x,num_array)))
result

15

In [54]:
list1 = [1, 2, 3, 4, 5]
list2 = [1, 2, 4, 8, 9]

result = sum(map(lambda x,y : x == y,list1,list2))
result

2

In [55]:
str1 = ["python","machine","learning"]
result = list(map(list,str1))
result

[['p', 'y', 't', 'h', 'o', 'n'],
 ['m', 'a', 'c', 'h', 'i', 'n', 'e'],
 ['l', 'e', 'a', 'r', 'n', 'i', 'n', 'g']]

In [56]:
list_tup = [("python","machine"),("learning","data science")]
result = list(map(" ".join,list_tup))
result

['python machine', 'learning data science']

In [57]:
list_tup = [("python","machine"),("learning","data science")]
result = list(map(" ".join,list_tup))
result

['python machine', 'learning data science']

In [58]:
l1 = [1,2,3]
l2 = [1,2,4,5,6]
result = list(filter(lambda x : x not in l1,l2))
result

[4, 5, 6]

In [59]:
from nltk.corpus import stopwords
stopword_list = stopwords.words("english")
result = filter(lambda x : x.lower() not in stopword_list,string)
result

AttributeError: partially initialized module 'nltk' has no attribute 'internals' (most likely due to a circular import)

In [60]:
l1 = [1,2,3]
l2 = [1,2,4,5,6]
result = list(filter(lambda x : x in l1,l2))
result

[1, 2]

In [61]:
l1 = [1,2,3]
result = list(filter(lambda x : x%2!=0,l1))
result

[1, 3]

In [62]:
l1 = [1,2,3]
result = list(filter(lambda x : x%2==0,l1))
result

[2]

In [1]:
with open("Abhishek.txt","r") as f:
    result = f.read()
    print(result)
    f.close()

He is god owns soldier

In [2]:
with open("Abhishek.txt","w") as f:
    f.write("""Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of 
    application domains.""")
    f.close()

with open("Abhishek.txt","r") as f:
    result = f.read()
    print(result)
    f.close()

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.

In [3]:
with open("Abhishek.txt","r") as f:
    result = f.readline()
    print(result)
    f.close()

Data Science:

In [4]:
text = """1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing"""
with open("Abhishek.txt","a") as f:
    f.write(text)
    f.close()

In [5]:
with open("Abhishek.txt","r") as f:
    result = f.readlines()
    print(result[-2:])
    f.close()

[' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing']

In [6]:
with open("Abhishek.txt","r") as f:
    result = f.readlines()
    print(result)
    f.close()

['Data Science:\n', '    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge\n', '    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of \n', '    application domains.1st:- Data Science\n', ' 2nd:- Machine Learning\n', ' 3rd:- Deep Learning\n', ' 4th:- Natural Language Processing']

In [7]:
with open("Abhishek.txt","r") as f:
    result = f.readlines()
    print(len(result))
    f.close()

7

In [8]:
with open("Abhishek.txt","r") as f:
    result = f.read()
    print(len(result))
    f.close()

376

In [10]:
import shutil
with open("Abhishek.txt","r") as f:
    result = f.read()
    print(result)
    f.close()

with open("Abhi.txt.txt","r") as f:
    result = f.read()
    print(result)
    f.close()

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language Processing

In [11]:
shutil.copy("Abhishek.txt","Abhi.txt.txt")

'Abhi.txt.txt'

In [12]:
with open("Abhi.txt.txt","r") as f:
    result = f.read()
    f.close()

In [13]:
result

'Data Science:\n    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge\n    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of \n    application domains.1st:- Data Science\n 2nd:- Machine Learning\n 3rd:- Deep Learning\n 4th:- Natural Language Processing'

In [14]:
from datetime import datetime
current_datetime = datetime.now()
print("Current datetime :",current_datetime)

current_year = current_datetime.year
print("Current year :",current_year)

result = current_datetime.strftime("%B")
print("Month of the year :",result)

result = current_datetime.strftime("%U")
print("Week number of the year :",result)

result = current_datetime.strftime("%A")
print("Week day of the week:",result)

result = current_datetime.strftime("%j")
print("Day of the year:",result)

result = current_datetime.strftime("%d")
print("Day of the month :",result)

Current datetime : 2024-04-18 07:51:58.429530
Current year : 2024
Month of the year : April
Week number of the year : 15
Week day of the week: Thursday
Day of the year: 109
Day of the month : 18

In [15]:
year = int(input("Enter a year:"))

if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print(f"{year} is a leap year")
else:
    print(f"{year} is not a leap year")

2024 is a leap year

In [16]:
year = int(input("Enter a year:"))

if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print(f"{year} is a leap year")
else:
    print(f"{year} is not a leap year")

2025 is not a leap year

In [18]:
date_format = "jan 1 2014 2:43PM"
date1 = "%b %d %Y %I:%M%p"
result = datetime.strptime(date_format, date1)
print(result)

2014-01-01 14:43:00

In [20]:
from datetime import timedelta
current_datetime = datetime.today()
result = current_datetime + timedelta(days=-5)
print(result)

2024-04-13 08:06:09.238607

In [21]:
result = datetime.today() + timedelta(days=-1)
print("Date of Yesterday:", result)

result = datetime.today() + timedelta(days=0)
print("Date of today:", result)

result = datetime.today() + timedelta(days=+1)
print("Date of tommorrow:", result)

Date of Yesterday: 2024-04-17 08:13:35.820882
Date of today: 2024-04-18 08:13:35.820882
Date of tommorrow: 2024-04-19 08:13:35.820882

In [22]:
current_datetime = datetime.today()
print(current_datetime)

current_datetime = datetime.now().date()
print(current_datetime)

for i in range(5):
    result = current_datetime + timedelta(days=i)
    print("Next 5 days starting from today:", result)

2024-04-18 08:26:49.081363
2024-04-18
Next 5 days starting from today: 2024-04-18
Next 5 days starting from today: 2024-04-19
Next 5 days starting from today: 2024-04-20
Next 5 days starting from today: 2024-04-21
Next 5 days starting from today: 2024-04-22

In [23]:
current_datetime = datetime.now()
print("Before time is:", current_datetime)

result = current_datetime.replace(microsecond=0)
print("After time is:", result)

Before time is: 2024-04-18 08:27:50.484462
After time is: 2024-04-18 08:27:50

In [24]:
import os
with open("Abhishek.txt","a") as f:
    f.write("He is god owns soldier")
    f.close()

with open("Abhishek.txt","r") as f:
    result = f.read()
    print(result)

os.rename("Abhishek.txt","Wakchaure.txt")

Data Science:
    It is an Interdisciplinary field that uses Scientific methods, processes, algorithms and systems to extract knowledge
    and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of
    application domains.1st:- Data Science
 2nd:- Machine Learning
 3rd:- Deep Learning
 4th:- Natural Language ProcessingHe is god owns soldier

In [25]:
os.getcwd()

'd:\\abhi python\\Python hands on\\Python-Hands-ON'

In [26]:
os.listdir()

['.git',
 'Abhi',
 'Abhi.txt.txt',
 'adaboost.ipynb',
 'Adaboost_Ass.ipynb',
 'ai4i2020.csv',
 'Ann_implementation.ipynb',
 'Assignment_1.ipynb',
 'Assignment_10.ipynb',
 'Assignment_11.ipynb',
 'Assignment_12.ipynb',
 'Assignment_13_LinearR.ipynb',
 'Assignment_2.ipynb',
 'Assignment_3.ipynb',
 'Assignment_4.ipynb',
 'Assignment_6.ipynb',
 'Assignment_7.ipynb',
 'Assignment_8.ipynb',
 'Assignment_9.ipynb',
 'Assignment_DT.ipynb',
 'Assignment_KNN.ipynb',
 'autos_dataset.csv',
 'Bangalore.ipynb',
 'Bengaluru_House_Data.csv',
 'Book2.csv',
 'Boston.csv',
 'cardio_alco.csv',
 'cardio_base.csv',
 'CNN.ipynb',
 'CNN_proj_explanation.ipynb',
 'CNN_rev.ipynb',
 'Copy1.txt',
 'Country_clusters.csv',
 'covid_data.csv',
 'DataFrame.csv',
 'DataFrame.xlsx',
 'dataset_es_train.csv',
 'Decision tree HYP_Tuning.png',
 'Decision Tree.png',
 'DecisionTree.ipynb',
 'Decision_Tree.png',
 'Decision_Tree_HYP.png',
 'Decision_Tree_REG_WithoutHYP.png',
 'Decision_TRee_Working.ipynb',
 'Deep_Learning.ipynb',
 'Deep_Learning_rev.ipynb',
 'DegreeofFreedom.png',
 'diabetes.csv',
 'Dim_red_tech.ipynb',
 'DRT.REV.ipynb',
 'DT_multiclass_clf.ipynb',
 'DT_Multiclass_clf_withoutHYP.png',
 'DT_Pruning.ipynb',
 'DT_pruning_revision.ipynb',
 'DT_regression.ipynb',
 'Elbow_method.png',
 'Emp_data.csv',
 'Emp_Records.xlsx',
 'emp_test1.csv',
 'heart.csv',
 'iframe_figures',
 'Imp_Interview_approach.ipynb',
 'IMP_Questions.ipynb',
 'Interview_questions.ipynb',
 'Iris.csv',
 'kmeans_clustering.ipynb',
 'KNN_all_clustering.ipynb',
 'KNN_classification.ipynb',
 'KNN_Clustering_Ass.ipynb',
 'Knn_Imputer.ipynb',
 'KNN_Regression.ipynb',
 'KNN_revision.ipynb',
 'Linear_reg_assignment.ipynb',
 'Linear_reg_theory.ipynb',
 'loan_data.csv',
 'Logistic_reg_assignment.ipynb',
 'movies_data.csv',
 'Naive_Bayes.ipynb',
 'Naive_Bayes_Ass.ipynb',
 'neg',
 'NLP.ipynb',
 'NLP_mini_project',
 'NLP_rev.ipynb',
 'PCA.ipynb',
 'PCA_rev.ipynb',
 'pos',
 'Predictive maintenance.ipynb',
 'Project.ipynb',
 'Prompt_Engineering.ipynb',
 'Python 1.ipynb',
 'python 10.ipynb',
 'python 11.ipynb',
 'python 12.ipynb',
 'python 2.ipynb',
 'python 3.ipynb',
 'python 4.ipynb',
 'python 5.ipynb',
 'python 6.ipynb',
 'python 7.ipynb',
 'python 8.ipynb',
 'python 9.ipynb',
 'Python_13.ipynb',
 'Python_14.ipynb',
 'Python_15.ipynb',
 'python_16.ipynb',
 'python_17.ipynb',
 'Random_forest_clf.ipynb',
 'README.md',
 'Sample.xls',
 'Sample1.xlsx',
 'Sampling.ipynb',
 'Scoring.png',
 'Social_Network_Ads.csv',
 'student.csv',
 'Support_vector_machine.ipynb',
 'SVM_Assignment.ipynb',
 'titanic.csv',
 'Train.csv',
 'Wakchaure.txt',
 'weather.csv',
 'weather1.csv',
 'word2vec.model']

In [27]:
try:
    print("Helllo")
except:
    print("I am here")

Helllo

In [2]:
import re 
string = "Python and Machine Learning 7741 is syllabus of Data Science."
result = re.findall(r"[a-zA-Z0-9]",string)
if result:
    print("Contains Characters")
else:
    print("Doesnot contain character")

Contains Characters

In [3]:
string = "Python and Machine Learning is syllabus of data science and deep learning."
result = re.split(r"and",string)
result

['Python ',
 ' Machine Learning is syllabus of data science ',
 ' deep learning.']

In [4]:
str1='Python and Data Science Batch 2023'
result = re.findall(r"\b\w{3}\b",str1)
result

['and']

In [5]:
sample_string = "There are 123 45 678 90 2345 67 12 345 6789 0123 three-digit"
result = re.findall(r"\b\d{3}\s\d{2}\b",sample_string)
result

['123 45', '678 90']

In [6]:
str1= "python and data pytthon science pythonnn pyyth annd pythh"
result = re.findall(r"p+",str1)
result

['p', 'p', 'p', 'p', 'p']

In [7]:
str1 = 'We can write INFORM in lowercase as inform'
result = re.findall(r"INFORM|inform",str1)
if result:
    print("String is present")
else:
    print("String is not present")

String is present

In [8]:
str1= " data science and pytthon science abbbss and pyt"
result = re.findall(r"py?",str1)
result

['py', 'py']

In [9]:
str1= "python and data pbbbtthon science pytbbbonnn and pyt"
result = re.findall(r"\b\w*[b]{3}\w*\b",str1)
result

['pbbbtthon', 'pytbbbonnn']

In [11]:
str1= "abbbs and data abbbsolutely science abbrivation and pyt"
result = re.findall(r"\b\w*[b]{2,3}\w*\b",str1)
result

['abbbs', 'abbbsolutely', 'abbrivation']

In [12]:
str1= "abbbs and data abbbsolutely or science an abbrivation and pyt"
result = re.findall(r"\b\w{3,5}\b",str1)
result

['abbbs', 'and', 'data', 'and', 'pyt']

In [13]:
str1= "abbbs and data abbbsolutely or science_ an abbrivation_ and pyt_"
result = re.findall(r"[a-z]+[_]",str1)
result

['science_', 'abbrivation_', 'pyt_']

In [14]:
str1= "Abbbs and Data Abbbsolutely or Science_ an Abbrivation_ and pyt_"
result = re.findall(r"[A-Z][a-z]+",str1)
result

['Abbbs', 'Data', 'Abbbsolutely', 'Science', 'Abbrivation']

In [15]:
str1= "data absorb Science and Abbrivation and pyt"
result = re.findall(r"\ba.+b\b",str1)
result

['absorb']

In [16]:
str1 = 'Suceess is a jurney not a desti9nation.'
result = re.findall("Suceess",str1)
result

['Suceess']

In [17]:
str1 = 'new begening of LIFE .'
result = re.findall("LIFE.",str1)
result

['LIFE ']

In [18]:
str1 = "today is the very lazy day"
result = re.findall(r"\b\w*z\w\b",str1)
result

['lazy']

In [19]:
str1 = "we have a lazy cat"
result = re.findall(r"[a-y]*z[a-y]",str1)
result

['lazy']

In [20]:
str1 = "RudrANSHI_12345_wadekar"
result = re.findall(r"\w{1,}",str1)
result

['RudrANSHI_12345_wadekar']

In [23]:
str1 = "9821 maya"
result = re.findall(r"^9",str1)
result

['9']

In [25]:
str1 = "9821 maya"
result = re.findall(r"^\d*",str1)
result

['9821']

In [26]:
ip_adress="216.008.904.196"
result = re.sub(r"\b0.","",ip_adress)
result

'216.8.904.196'

In [27]:
ip_adress="216.008.904.196"
result = re.sub(r"\b0.","",ip_adress)
result

'216.8.904.196'

In [28]:
str1="Python is required for data science version 3.2"
result = re.findall(r"\d\b",str1)
result

['3', '2']

In [29]:
str1="Python is required for data science version 3.2"
result = re.findall(r"\d..\b",str1)
result

['3.2']

In [30]:
str1 = "Exercises number 1, 12, 13, and 345 are important"
result = re.findall(r"[0-9]{1,3}",str1)
result

['1', '12', '13', '345']

In [31]:
Sample_text ='The quick brown fox jumps over the lazy dog.'
Searched_words ='fox', 'dog', 'horse'
for word in Searched_words:
    result = re.findall(word,Sample_text)
    print(result)

['fox']
['dog']
[]

In [32]:
sample_text ='The quick brown fox jumps over the lazy dog.'
result = re.search(r"fox",sample_text)
result

In [34]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
result

['exercises', 'exercises', 'exercises']

In [35]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
print(len(result))

3

In [36]:
result = re.search(r"exercises",Sample_text)
print(result)

<re.Match object; span=(7, 16), match='exercises'>

In [37]:
str1 = 'The quick brown fox jumps over the lazy dog.'
result = re.sub(r"[ ]","_",str1)
result

'The_quick_brown_fox_jumps_over_the_lazy_dog.'

In [38]:
result = re.sub(r"[_]","",result)
result

'Thequickbrownfoxjumpsoverthelazydog.'

In [39]:
str1 = 'The quick brown fox jumps over the lazy dog.'
result = re.sub(r"[ ]","",str1)
result

'Thequickbrownfoxjumpsoverthelazydog.'

In [40]:
str1= "python and data science pythonnn"
result = re.findall(r"[p]\w*",str1)
result

['python', 'pythonnn']

In [42]:
str1= "data science and python learning with begening every evening "
result = re.findall(r"\b[a,e]\w*\b",str1)
result

['and', 'every', 'evening']

In [44]:
str1= "data science and python learning with begening every evening "
result = re.findall(r"\b[a,e]\w*\b",str1)
result

['and', 'every', 'evening']

In [45]:
str1 = "i am mrunal chaudhari ,my age is 24"
result = re.search(r"\d",str1)
result

In [46]:
text ="""Python. is a general,purpose, interpreted."""
result = re.sub(r"[., ]",":",text)
result

'Python::is:a:general:purpose::interpreted:'

In [47]:
text ="""Python., is a general purpose interpreted."""
result = re.sub(r"[,. ]{2}",":",text)
result

'Python: is a general purpose interpreted.'

In [48]:
text ="""123 Python is a general-purpose, interpreted,
high-level programming language popularly used for
website development, data analytics 78 and automation."""

result = re.findall(r"\b\D{3,5}\b", text)
result

[' is a', 'high-', 'level', ' used', ' for\n', 'data ', ' and ']

In [1]:
import numpy as np 
arr1 = np.zeros(10)
arr1

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [3]:
arr1.nbytes

80

In [4]:
arr1 = np.zeros(10)
print(arr1)
arr1[4] = 1
arr1

[0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]

array([0., 0., 0., 0., 1., 0., 0., 0., 0., 0.])

In [5]:
arr1 = np.arange(15,46)
arr1

array([15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
       32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45])

In [6]:
arr1[::-1]

array([45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31, 30, 29,
       28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15])

In [7]:
arr1 = np.arange(15,46)
print(arr1)
result = list(reversed(arr1))
result

[15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38
 39 40 41 42 43 44 45]

[45,
 44,
 43,
 42,
 41,
 40,
 39,
 38,
 37,
 36,
 35,
 34,
 33,
 32,
 31,
 30,
 29,
 28,
 27,
 26,
 25,
 24,
 23,
 22,
 21,
 20,
 19,
 18,
 17,
 16,
 15]

In [8]:
arr1 = np.random.randint(1,10,size=(2,2))
print("Array1 :\n",arr1)
arr2 = np.random.randint(20,30,size=(2,2))
print("Array2 :\n",arr2)

Array1 :
 [[2 2]
 [5 5]]
Array2 :
 [[25 20]
 [25 29]]

In [10]:
add1 = arr1 + arr2
add1

array([[27, 22],
       [30, 34]])

In [11]:
sub1 = arr1 - arr2
sub1

array([[-23, -18],
       [-20, -24]])

In [12]:
arr1 = np.array([1.3,1.8,2.3,3.9,1,4,1.9,9,.3])
print(arr1)
arr1.round()

[1.3 1.8 2.3 3.9 1.  4.  1.9 9.  0.3]

array([1., 2., 2., 4., 1., 4., 2., 9., 0.])

In [13]:
np.floor(arr1)

array([1., 1., 2., 3., 1., 4., 1., 9., 0.])

In [14]:
np.ceil(arr1)

array([2., 2., 3., 4., 1., 4., 2., 9., 1.])

In [16]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print(arr1)
mean_row = np.mean(arr1 , axis=1)
print("Mean across row >>",mean_row)
mean_col = np.mean(arr1 , axis=0)
print("Mean across col >>",mean_col)

[[1 2 3]
 [4 5 6]
 [7 8 9]]
Mean across row >> [2. 5. 8.]
Mean across col >> [4. 5. 6.]

In [17]:
list1 = [0,30,45,60,90]
result = np.deg2rad(list1)
result

array([0.        , 0.52359878, 0.78539816, 1.04719755, 1.57079633])

In [18]:
arr1 = np.random.randint(0,8,size=(3,3))
print("Matrix :\n",arr1)

Matrix :
 [[5 3 2]
 [7 2 0]
 [2 2 6]]

In [20]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print("Matrix :\n",arr1)
arr1[:: , :: -1]

Matrix :
 [[1 2 3]
 [4 5 6]
 [7 8 9]]

array([[3, 2, 1],
       [6, 5, 4],
       [9, 8, 7]])

In [22]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print("Matrix :\n",arr1)
arr1[::-1]

Matrix :
 [[1 2 3]
 [4 5 6]
 [7 8 9]]

array([[7, 8, 9],
       [4, 5, 6],
       [1, 2, 3]])

In [23]:
result = np.nonzero([1,2,0,0,4,0])
result

(array([0, 1, 4], dtype=int64),)

In [24]:
arr1 = np.array([[1,2],[3,4]])
print("Matrix :\n",arr1)
result = np.linalg.det(arr1)
result

Matrix :
 [[1 2]
 [3 4]]

-2.0000000000000004

In [25]:
arr1 = np.array([[2,3],[3,9]])
print("Matrix :\n",arr1)
result = np.linalg.inv(arr1)
result

Matrix :
 [[2 3]
 [3 9]]

array([[ 1.        , -0.33333333],
       [-0.33333333,  0.22222222]])

In [26]:
arr1 = np.random.randint(10,30,size=(30))
print("Matrix is:\n",arr1)
result = np.mean(arr1)
result

Matrix is:
 [12 23 21 24 12 28 23 13 20 14 20 15 16 21 13 23 22 28 20 15 15 14 12 17
 13 18 16 12 29 16]

18.166666666666668

In [27]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
print("Array :",arr1)
result = np.where(arr1 > 5)
result

Array : [ 1  2  3  4  5  6  7  8  9 10]

(array([5, 6, 7, 8, 9], dtype=int64),)

In [28]:
arr1 = np.random.random((3,3,3))
print("Array:\n",arr1)

Array:
 [[[0.65620434 0.56923312 0.68331662]
  [0.16819383 0.24296435 0.38560762]
  [0.60918718 0.54286227 0.51952073]]

 [[0.62972911 0.17273137 0.81755867]
  [0.81025541 0.33259822 0.38818601]
  [0.50452408 0.52822897 0.20594494]]

 [[0.16462569 0.17763868 0.36977483]
  [0.90481291 0.40562136 0.18078615]
  [0.99445313 0.38082677 0.39712708]]]

In [29]:
arr1 = np.random.rand(10,10)
print("Array:\n",arr1)
np.max(arr1)

Array:
 [[0.86702428 0.03004236 0.44543515 0.68159328 0.56324136 0.6879511
  0.82191766 0.42261653 0.84043948 0.18255163]
 [0.97490951 0.38961806 0.50845599 0.33355485 0.51612112 0.22414417
  0.05447292 0.37602049 0.53036167 0.8144287 ]
 [0.83690735 0.07258917 0.20241791 0.87730338 0.68187988 0.47450111
  0.38589474 0.71143568 0.36063683 0.26959688]
 [0.76943479 0.37599333 0.87166612 0.29788634 0.11068226 0.37993972
  0.93592185 0.05636197 0.85054047 0.91832649]
 [0.70189239 0.61393123 0.12956265 0.56569773 0.76249881 0.95950295
  0.58456025 0.63319094 0.34252982 0.64425867]
 [0.8720953  0.33837409 0.73832148 0.39748928 0.82455596 0.06748362
  0.99943888 0.34853805 0.99630968 0.68591465]
 [0.41690599 0.48941222 0.38279415 0.24205547 0.74744457 0.22249083
  0.15620407 0.41372864 0.47173239 0.28659056]
 [0.90162323 0.76896853 0.69619668 0.30570259 0.39427081 0.59396325
  0.82955009 0.92043706 0.64867813 0.63748529]
 [0.16125699 0.06255379 0.01915801 0.46004956 0.18896932 0.95723136
  0.47422639 0.63482791 0.33853747 0.20708376]
 [0.28606695 0.69669145 0.96797367 0.95504326 0.87965965 0.76545586
  0.62644256 0.39790349 0.33516991 0.94473671]]

0.999438875783195

In [30]:
np.min(arr1)

0.019158008113563496

In [31]:
arr1 = np.ones((10,10))
arr1[1:-1,1:-1] = 0
print(arr1)

[[1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]]

In [32]:
arr1 = np.ones((10,10))
print(arr1)
arr1[1:-1,1:-1] = 0 
arr1

[[1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]]

array([[1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.]])

In [33]:
arr1 = np.zeros((10,10),dtype=int)
np.fill_diagonal(arr1[1:] , [1,2,3,4])
print(arr1)

[[0 0 0 0 0 0 0 0 0 0]
 [1 0 0 0 0 0 0 0 0 0]
 [0 2 0 0 0 0 0 0 0 0]
 [0 0 3 0 0 0 0 0 0 0]
 [0 0 0 4 0 0 0 0 0 0]
 [0 0 0 0 1 0 0 0 0 0]
 [0 0 0 0 0 2 0 0 0 0]
 [0 0 0 0 0 0 3 0 0 0]
 [0 0 0 0 0 0 0 4 0 0]
 [0 0 0 0 0 0 0 0 1 0]]

In [34]:
arr1 = np.zeros((5,5),dtype=int)
np.fill_diagonal(arr1[1:] , [1,2,3,4])
arr1

array([[0, 0, 0, 0, 0],
       [1, 0, 0, 0, 0],
       [0, 2, 0, 0, 0],
       [0, 0, 3, 0, 0],
       [0, 0, 0, 4, 0]])

In [35]:
arr1 = np.zeros((5,5),dtype=int)
np.fill_diagonal(arr1[1:],[1,2,3,4])
arr1

array([[0, 0, 0, 0, 0],
       [1, 0, 0, 0, 0],
       [0, 2, 0, 0, 0],
       [0, 0, 3, 0, 0],
       [0, 0, 0, 4, 0]])

In [36]:
arr1 = np.eye(3,3)
print(arr1)

[[1. 0. 0.]
 [0. 1. 0.]
 [0. 0. 1.]]

In [37]:
arr1 = np.random.randint(1,9,size=(5,3))
arr2 = np.random.randint(1,9,size=(3,2))
result = np.dot(arr1, arr2)
print("Array 1 :\n",arr1)
print("Array 2 :\n",arr2)
print("Multiplication array :\n",result)

Array 1 :
 [[3 2 2]
 [4 6 8]
 [3 4 2]
 [5 4 8]
 [1 8 6]]
Array 2 :
 [[4 3]
 [4 1]
 [5 1]]
Multiplication array :
 [[30 13]
 [80 26]
 [38 15]
 [76 27]
 [66 17]]

In [38]:
arr1 = np.array([1,2,3,4,5,6,7,8,44,9,33,6,5,10])
result = np.where((arr1>=3) & (arr1<=8) , -1*arr1 , arr1)
result

array([ 1,  2, -3, -4, -5, -6, -7, -8, 44,  9, 33, -6, -5, 10])

In [39]:
arr1 = np.array([[1.215413,2.654139],[3.4513056,5.2141555]])
print("Original array:\n",arr1)
np.round(arr1,1)

Original array:
 [[1.215413  2.654139 ]
 [3.4513056 5.2141555]]

array([[1.2, 2.7],
       [3.5, 5.2]])

In [40]:
arr1 = np.array([[1.215413,2.654139],[3.4513056,5.2141555]])
print(arr1)
np.floor(arr1)

[[1.215413  2.654139 ]
 [3.4513056 5.2141555]]

array([[1., 2.],
       [3., 5.]])

In [41]:
np.ceil(arr1)

array([[2., 3.],
       [4., 6.]])

In [42]:
arr1 = np.array([1,2,3,4,5,6])
arr2 = np.array([4,5,6,7,8,9])
result = np.intersect1d(arr1,arr2)
result

array([4, 5, 6])

In [43]:
arr1 = np.linspace(0,1,10)[1:-1]
print("Array:\n",arr1)

Array:
 [0.11111111 0.22222222 0.33333333 0.44444444 0.55555556 0.66666667
 0.77777778 0.88888889]

In [44]:
arr1 = np.random.randint(1,10,size=(10))
print("Array:",arr1)
result = np.sort(arr1)
result

Array: [2 6 8 1 4 2 2 9 6 6]

array([1, 2, 2, 2, 4, 6, 6, 6, 8, 9])

In [45]:
arr1 = np.zeros((5,5))
print("Array:\n",arr1)
result = arr1 + np.arange(5)
result

Array:
 [[0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]]

array([[0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.]])

In [46]:
arr1 = np.random.randint(0,5,size=5)
arr2 = np.random.randint(0,5,size=5)
if np.equal == True:
    print("Both arrays are equal")
else:
    print("Both arrays are not equal")

Both arrays are not equal

In [47]:
arr1 = np.random.randint(0,5,size=5)
arr2 = np.random.randint(0,5,size=5)
result = np.allclose(arr1,arr2)
result

False

In [48]:
arr1 = np.random.randint(1,10,size=(10))
print("Array:",arr1)
result = np.where(arr1 == np.max(arr1) , 0 , arr1)
result

Array: [1 3 2 3 4 6 9 8 1 2]

array([1, 3, 2, 3, 4, 6, 0, 8, 1, 2])

In [49]:
arr1 = np.array([[[1,2,3],[4,5,6],[7,8,9]]])
for i in np.nditer(arr1):
    print(i,end=" ")

1 2 3 4 5 6 7 8 9

In [50]:
arr1 = np.array([[[1,2,3],[4,5,6],[7,8,9]]])
for index,value in np.ndenumerate(arr1):
    print(f"{index} index has {value} value")

(0, 0, 0) index has 1 value
(0, 0, 1) index has 2 value
(0, 0, 2) index has 3 value
(0, 1, 0) index has 4 value
(0, 1, 1) index has 5 value
(0, 1, 2) index has 6 value
(0, 2, 0) index has 7 value
(0, 2, 1) index has 8 value
(0, 2, 2) index has 9 value

In [51]:
arr1 = np.random.randint(1,10,size=(3,3))
print("Array:\n",arr1)
result = (arr1[arr1[:,2].argsort()])
result

Array:
 [[8 6 1]
 [1 9 9]
 [5 6 9]]

array([[8, 6, 1],
       [1, 9, 9],
       [5, 6, 9]])

In [52]:
arr1 = np.array([[4,3,1],[5,8,9],[3,4,5]])
print("Array:\n",arr1)
arr1[[0,2]] = arr1[[2,0]]
arr1

Array:
 [[4 3 1]
 [5 8 9]
 [3 4 5]]

array([[3, 4, 5],
       [5, 8, 9],
       [4, 3, 1]])

In [53]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
result = np.mean(arr1)
result

5.5

In [54]:
arr1

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [55]:
np.median(arr1)

5.5

In [56]:
arr1 = np.random.randint(1,10,size=10)
print(arr1)
print("Standard deviation of the numpy array:",np.std(arr1))

[9 7 1 2 7 6 6 4 1 1]
Standard deviation of the numpy array: 2.835489375751565

In [57]:
from scipy.stats import mode
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
result = mode(arr1)
result

ModeResult(mode=1, count=1)

In [58]:
result = np.around(5.3244,3)
result

5.324

In [59]:
arr1 = np.array([[2,3],[3,4]])
result = np.linalg.inv(arr1)
result

array([[-4.,  3.],
       [ 3., -2.]])

In [60]:
x = np.array([1,2,3])
y = np.array([4,5,6])
result = np.cov(x,y)
result

array([[1., 1.],
       [1., 1.]])

In [62]:
arr1 = np.array([1,1,2,2,3,4,5,6,7,8,9,6,4,3,6,7])
result = mode(arr1)[0]
result

6

In [63]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
print(arr1)
result = np.reshape(arr1, (2,5,1))
result

[ 1  2  3  4  5  6  7  8  9 10]

array([[[ 1],
        [ 2],
        [ 3],
        [ 4],
        [ 5]],

       [[ 6],
        [ 7],
        [ 8],
        [ 9],
        [10]]])

In [64]:
arr1 = np.random.randint(1,20,size=(1,2,3,4))
print(arr1)
result = np.reshape(arr1 , (6,4))
result

[[[[ 3  8 16  1]
   [12 13  6 18]
   [ 6 11 18  9]]

  [[ 7  5  4 13]
   [11  1 19  6]
   [ 5 14  5 19]]]]

array([[ 3,  8, 16,  1],
       [12, 13,  6, 18],
       [ 6, 11, 18,  9],
       [ 7,  5,  4, 13],
       [11,  1, 19,  6],
       [ 5, 14,  5, 19]])

In [65]:
arr1 = np.zeros(10,dtype=int)
arr1

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [66]:
arr1 = np.array([[1,2,3,4],[5,6,8,7],[3,4,5,6]])
arr1.shape

(3, 4)

In [1]:
import pandas as pd 
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
list1 = [[1,2,3],[4,5,6]]
result = pd.DataFrame(list1)
result

   0  1  2
0  1  2  3
1  4  5  6

In [3]:
df = pd.DataFrame(columns=list("ABC"),index=list("PQR"))
df

     A    B    C
P  NaN  NaN  NaN
Q  NaN  NaN  NaN
R  NaN  NaN  NaN

In [4]:
df = pd.DataFrame(columns=list("ABC"),index=list("PQR"))
if df.isnull:
    print("Dataframe is empty")
else:
    print("Dataframe is not empty")

Dataframe is empty

In [7]:
import numpy as np
arr1 = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(arr1)
df

   0  1  2
0  1  2  3
1  4  5  6

In [8]:
list1 = [[1,2,3],[4,5,6]]
df = pd.DataFrame(list1)
df

   0  1  2
0  1  2  3
1  4  5  6

In [9]:
tuple1 = (1,2,3,4,5,6)
df = pd.DataFrame(tuple1)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [10]:
dict1 = {"name" : ["hindvi","ovi","rudu"] , "marks" : [80,70,90]}
df = pd.DataFrame(dict1)
df

     name  marks
0  hindvi     80
1     ovi     70
2    rudu     90

In [11]:
l1 = [[1,2,3],[4,5,6],[7,8,9]]
df = pd.DataFrame(l1,columns=list("ABC"))
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
df = pd.DataFrame(np.random.randint(1,10,size=(5,6)))
df

   0  1  2  3  4  5
0  6  9  5  8  1  7
1  5  6  7  4  3  3
2  4  3  8  5  3  1
3  7  7  3  1  3  6
4  3  8  2  1  4  1

In [13]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
df = pd.DataFrame(arr1)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
dict1 = {"name" : ["hindvi","ovi","rudu"] , "marks" : [80,70,90]}
df = pd.DataFrame(dict1)
df

     name  marks
0  hindvi     80
1     ovi     70
2    rudu     90

In [15]:
s1 = pd.Series([1,2,3,4,5,6])
s2 = s1.copy()
s2[0] = 50
print("Original Series :\n",s1)
print("Copied Series :\n",s2)

Original Series :
 0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
Copied Series :
 0    50
1     2
2     3
3     4
4     5
5     6
dtype: int64

In [16]:
df = pd.DataFrame(np.full((4,5),6))
df["5"] = [1,2,3,4]
df

   0  1  2  3  4  5
0  6  6  6  6  6  1
1  6  6  6  6  6  2
2  6  6  6  6  6  3
3  6  6  6  6  6  4

In [17]:
df.loc[4] = [1,2,3,4,5,6]
df

   0  1  2  3  4  5
0  6  6  6  6  6  1
1  6  6  6  6  6  2
2  6  6  6  6  6  3
3  6  6  6  6  6  4
4  1  2  3  4  5  6

In [18]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
df = pd.DataFrame(arr1,index=list("ABC"))
df

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [19]:
arr1 = np.random.randint(0,20,size=(4,4))
df = pd.DataFrame(arr1,columns=list("ABCD"),index=list("PQRS"))
df.rename({"A":"a","B":"b","C":"c","D":"d"},axis=1,inplace=True)
df.rename({"P":"p","Q":"q","R":"r","S":"s"},axis=0,inplace=True)
df

    a   b   c  d
p  13  13   1  6
q  11   0  16  6
r  13   7   8  5
s  14   9  18  4

In [20]:
for i in df.items():
    print(i)

('a', p    13
q    11
r    13
s    14
Name: a, dtype: int32)
('b', p    13
q     0
r     7
s     9
Name: b, dtype: int32)
('c', p     1
q    16
r     8
s    18
Name: c, dtype: int32)
('d', p    6
q    6
r    5
s    4
Name: d, dtype: int32)

In [21]:
for i in df.iterrows():
    print(i)

('p', a    13
b    13
c     1
d     6
Name: p, dtype: int32)
('q', a    11
b     0
c    16
d     6
Name: q, dtype: int32)
('r', a    13
b     7
c     8
d     5
Name: r, dtype: int32)
('s', a    14
b     9
c    18
d     4
Name: s, dtype: int32)

In [22]:
df = pd.DataFrame(np.random.randint(10,20,size=(4,4)))
print(df)
arr1 = df.values
arr1

    0   1   2   3
0  19  18  15  16
1  15  16  13  12
2  13  13  17  16
3  19  18  12  18

array([[19, 18, 15, 16],
       [15, 16, 13, 12],
       [13, 13, 17, 16],
       [19, 18, 12, 18]])

In [23]:
df = pd.DataFrame(np.random.randint(10,20,size=(4,4)))
print(df)
arr1 = df.values
arr1.tolist()

    0   1   2   3
0  16  13  12  18
1  17  12  13  14
2  10  15  11  10
3  13  17  19  10

[[16, 13, 12, 18], [17, 12, 13, 14], [10, 15, 11, 10], [13, 17, 19, 10]]

In [24]:
df

    0   1   2   3
0  16  13  12  18
1  17  12  13  14
2  10  15  11  10
3  13  17  19  10

In [25]:
df.reset_index(drop=True)

    0   1   2   3
0  16  13  12  18
1  17  12  13  14
2  10  15  11  10
3  13  17  19  10

In [26]:
df = pd.DataFrame(np.random.randint(10,20,size=(4,5)))
print(df)
print("No of rows :",df.shape[0])
print("No of columns :",df.shape[1])

    0   1   2   3   4
0  16  16  19  15  18
1  14  10  13  17  12
2  16  11  19  12  16
3  12  13  11  17  12
No of rows : 4
No of columns : 5

In [28]:
s1 = pd.Series(np.arange(50,60))
s2 = pd.Series(np.arange(25,35))
result = s1 + s2
result

0    75
1    77
2    79
3    81
4    83
5    85
6    87
7    89
8    91
9    93
dtype: int32

In [29]:
result = s1 - s2
result

0    25
1    25
2    25
3    25
4    25
5    25
6    25
7    25
8    25
9    25
dtype: int32

In [30]:
result = s1 * s2
result

0    1250
1    1326
2    1404
3    1484
4    1566
5    1650
6    1736
7    1824
8    1914
9    2006
dtype: int32

In [31]:
result = s1 / s2
result

0    2.000000
1    1.961538
2    1.925926
3    1.892857
4    1.862069
5    1.833333
6    1.806452
7    1.781250
8    1.757576
9    1.735294
dtype: float64

In [32]:
df = pd.read_excel("Sample1.xlsx")
df

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587
3,4,Kathleen,Hanner,Female,United States,25,15/10/2017,3549
4,5,Nereida,Magwood,Female,United States,58,16/08/2016,2468
...,...,...,...,...,...,...,...,...
995,996,Roma,Lafollette,Female,United States,34,15/10/2017,2654
996,997,Felisa,Cail,Female,United States,28,16/08/2016,6525
997,998,Demetria,Abbey,Female,United States,32,21/05/2015,3265
998,999,Jeromy,Danz,Male,United States,39,15/10/2017,3265
999,1000,Rasheeda,Alkire,Female,United States,29,16/08/2016,6125

In [33]:
df.columns

Index(['Unnamed: 0', 'First Name', 'Last Name', 'Gender', 'Country', 'Age',
       'Date', 'Id'],
      dtype='object')

In [34]:
df[['First Name', 'Last Name']]

    First Name   Last Name
0        Dulce       Abril
1         Mara   Hashimoto
2       Philip        Gent
3     Kathleen      Hanner
4      Nereida     Magwood
..         ...         ...
995       Roma  Lafollette
996     Felisa        Cail
997   Demetria       Abbey
998     Jeromy        Danz
999   Rasheeda      Alkire

[1000 rows x 2 columns]

In [35]:
df["Age"].sum()

33260

In [36]:
df["Age"].min()

21

In [37]:
df["Age"].max()

58

In [38]:
df["Age"].mean()

33.26

In [39]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [40]:
df.groupby(df["Embarked"]).get_group("S")

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [3]:
import pandas as pd
import numpy as np
arr1 = np.random.randint(1,20,size=(4,2))
df = pd.DataFrame(arr1)
df.apply(np.sqrt)

          0         1
0  3.316625  2.645751
1  3.872983  3.872983
2  2.236068  3.000000
3  1.414214  3.162278

In [4]:
df = pd.DataFrame(np.random.randint(1,10,size=(3,4)))
df

   0  1  2  3
0  7  3  7  5
1  6  5  7  7
2  5  5  9  1

In [5]:
df.apply(lambda x : x**2)

    0   1   2   3
0  49   9  49  25
1  36  25  49  49
2  25  25  81   1

In [6]:
df.apply(lambda x : x**3)

     0    1    2    3
0  343   27  343  125
1  216  125  343  343
2  125  125  729    1

In [7]:
arr1 = np.random.randint(1,20,size=(4,2))
df = pd.DataFrame(arr1)
print(df)
df.apply(lambda x : x**2)

    0   1
0   4   5
1  15   6
2  11  16
3   2   8

     0    1
0   16   25
1  225   36
2  121  256
3    4   64

In [8]:
df = pd.read_csv("diabetes.csv")
df.head(3)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 8 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Glucose                   768 non-null    int64
 1   BloodPressure             768 non-null    int64
 2   SkinThickness             768 non-null    int64
 3   Insulin                   768 non-null    int64
 4   BMI                       768 non-null    float64
 5   DiabetesPedigreeFunction  768 non-null    float64
 6   Age                       768 non-null    int64
 7   Outcome                   768 non-null    int64
dtypes: float64(2), int64(6)
memory usage: 48.1 KB

In [11]:
df.describe()

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,121.117188,69.076823,20.536458,79.799479,31.992578,0.471876,33.243490,0.348958
std,31.805091,19.367794,15.952218,115.244002,7.884160,0.331329,11.758182,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,142.000000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [12]:
data1 = {"NAME" : ["Rudranshi","Sanvi","Swati","Shiva"]}
df = pd.DataFrame(data1)
df["NAME"].apply(lambda x : x.istitle())

0    True
1    True
2    True
3    True
Name: NAME, dtype: bool

In [13]:
d1 = {"Employee":["Saniya","Sara","Alexa","Jenny"]}
df = pd.DataFrame(d1)
d2 = {"Saniya": "Software Developer" , "Sara":"Developer" , "Alexa":"Assistant"}
df["Designation"] = df["Employee"].map(d2)
df

  Employee         Designation
0   Saniya  Software Developer
1     Sara           Developer
2    Alexa           Assistant
3    Jenny                 NaN

In [14]:
arr1 = np.random.randint(1,10,size=(5,5))
df = pd.DataFrame(arr1,columns=list("ABCDE"))
df

   A  B  C  D  E
0  6  9  2  1  1
1  6  6  6  1  9
2  5  1  1  8  8
3  4  5  9  5  4
4  4  6  5  9  5

In [15]:
df["I"] = [1,2,3,4,5]
df

   A  B  C  D  E  I
0  6  9  2  1  1  1
1  6  6  6  1  9  2
2  5  1  1  8  8  3
3  4  5  9  5  4  4
4  4  6  5  9  5  5

In [16]:
arr1 = np.random.randint(1,10,size=(5,5))
df = pd.DataFrame(arr1,columns=list("ABCDE"))
df.insert(1,"H",[1,2,1,2,1])
df

   A  H  B  C  D  E
0  7  1  4  2  1  2
1  7  2  9  5  2  4
2  6  1  4  9  5  1
3  6  2  6  1  7  2
4  9  1  8  2  6  7

In [17]:
df

   A  H  B  C  D  E
0  7  1  4  2  1  2
1  7  2  9  5  2  4
2  6  1  4  9  5  1
3  6  2  6  1  7  2
4  9  1  8  2  6  7

In [18]:
df.drop("A",axis=1,inplace=True)

In [19]:
df

   H  B  C  D  E
0  1  4  2  1  2
1  2  9  5  2  4
2  1  4  9  5  1
3  2  6  1  7  2
4  1  8  2  6  7

In [20]:
df.drop(2,axis=0,inplace=True)
df

   H  B  C  D  E
0  1  4  2  1  2
1  2  9  5  2  4
3  2  6  1  7  2
4  1  8  2  6  7

In [21]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([4,5,6,7,8])
s11 = set(s1)
s22 = set(s2)
result = s11.symmetric_difference(s22)
result

{1, 2, 3, 6, 7, 8}

In [22]:
s1 = pd.Series([1,2,3,4,5])
print("Median:",s1.median())
print("Minimum :",s1.min())
print("25th percentile :",s1.quantile(0.25))
print("75th percentile :",s1.quantile(0.75))
print("Maximum :",s1.max())

Median: 3.0
Minimum : 1
25th percentile : 2.0
75th percentile : 4.0
Maximum : 5

In [23]:
df = pd.DataFrame(np.random.randint(10,50,size=(4,4)) , columns=list("CABD") , index=list("xzvs"))
df

    C   A   B   D
x  32  11  49  19
z  38  49  28  17
v  20  26  42  25
s  33  10  18  17

In [24]:
df.sort_index()

    C   A   B   D
s  33  10  18  17
v  20  26  42  25
x  32  11  49  19
z  38  49  28  17

In [25]:
df.sort_index(axis=1)

    A   B   C   D
x  11  49  32  19
z  49  28  38  17
v  26  42  20  25
s  10  18  33  17

In [26]:
df.sort_values("D")

    C   A   B   D
z  38  49  28  17
s  33  10  18  17
x  32  11  49  19
v  20  26  42  25

In [27]:
df = pd.DataFrame({"A" : [1,1,3,4,5],
                   "B" : [1,1,3,4,5],
                   "C" : [1,1,3,4,5],
                   "D" : [1,1,3,4,5]})
df

   A  B  C  D
0  1  1  1  1
1  1  1  1  1
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5

In [28]:
df.drop_duplicates()

   A  B  C  D
0  1  1  1  1
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5

In [29]:
df.drop("A",axis=1,inplace=True)

In [30]:
df

   B  C  D
0  1  1  1
1  1  1  1
2  3  3  3
3  4  4  4
4  5  5  5

In [31]:
data = {'Full Name': ['John Doe', 'Jane Smith', 'Bob Johnson']}
df = pd.DataFrame(data)

df[["First Name","Last Name"]] = df["Full Name"].str.split(expand=True)
df

     Full Name First Name Last Name
0     John Doe       John       Doe
1   Jane Smith       Jane     Smith
2  Bob Johnson        Bob   Johnson

In [1]:
even_no = []
odd_no = []
for i in range(1,10):
    if i % 2 == 0:
        even_no.append(i)
    else:
        odd_no.append(i)
print("Even numbers are:",even_no)
print("Odd numbers are:",odd_no)

Even numbers are: [2, 4, 6, 8]
Odd numbers are: [1, 3, 5, 7, 9]

In [ ]:
list1 = [1,2,3,4,5]
list2 = [a,b,c,d,e]

In [3]:
abc = [5,10,15,25,40,65]
output = [15,25,40,65]
output = []
for i in abc:
    if i % 5 == 0 and i > 10:
        output.append(i)
print(output)

[15, 25, 40, 65]